{
    "tt0047396": [
        "What’s the name of the movie where a photographer stuck in a wheelchair spies on his neighbors and gets obsessed with one of them being possibly involved in his wife’s disappearance?",
        "Is there a Hitchcock film where a man, recovering from an injury in his apartment, becomes suspicious of his neighbor who seems to be hiding something sinister involving his missing wife? The photographer is in a wheelchair and uses binoculars to observe the strange activities at night.",
        "Can anyone tell me about a thriller where a photographer with a broken leg spends his days spying on his neighbors from his apartment, only to suspect one of them has committed murder? He convinces his girlfriend and a nurse to help him investigate, but things take a dangerous turn. I think it’s set in the summer.",
        "In which Hitchcock film does a photographer with a broken leg spend his days spying on his neighbors from his apartment, only to suspect one of them has committed murder? He gets his girlfriend involved, and together they investigate, risking their lives as they uncover a dangerous secret. It involves a mysterious salesman, a missing wife, and a lot of tense moments. The movie ends with a twist and an unforgettable final scene.",
        "What is the name of the classic suspense thriller where a photographer in a wheelchair becomes convinced that his neighbor, a salesman, has killed his wife and hidden the body? He watches the neighbor’s every move from his apartment window, even after the police dismiss his theory. When his girlfriend sneaks into the neighbor’s apartment to find evidence, she nearly becomes the next victim. The movie ends with a dangerous confrontation and a twist that leaves the protagonist, who’s already broken his leg, in even more peril."
    ],
    "tt0086879": [
        "movie about an old composer confessing to a priest that he plotted against a younger, more talented rival musician in 18th century Vienna after being consumed by jealousy and believing God favored the other composer despite his crude personality",
        "historical drama about a court composer's descent into madness and his intricate scheme to sabotage a genius prodigy's career and steal credit for his work, focusing on themes of envy, faith, and artistic rivalry set against a backdrop of classical music and royal courts in Europe",
        "film where an established musician feels betrayed by God when a vulgar but brilliant young composer rises to fame, leading him to commission a requiem mass with sinister intentions, exploring the psychological torment of a man who believes himself to be divinely overlooked for true genius",
        "story of a rivalry between two classical composers, one pious and hardworking but overshadowed, the other a natural genius with a coarse demeanor, culminating in a plot involving a mysterious commission for a death mass and the downfall of the more talented artist, set in the operatic world of late 1700s Vienna with strong emotional undertones of professional jealousy and spiritual crisis",
        "period piece about a composer who attempts suicide, then recounts his life story to a priest, detailing his fervent religious devotion, his initial success, and his eventual profound jealousy and dark machinations against a younger, divinely gifted musician whose music he considers miraculous but whose personality he despises, exploring the themes of unfulfilled ambition, divine injustice, and the destructive power of envy, ending with the younger composer's tragic death and a sense of bitter triumph for the elder"
    ],
    "tt0034583": [
        "Movie about an American expatriate running a nightclub in World War 2 Morocco, where refugees try to get exit visas, and his past love unexpectedly reappears.",
        "Searching for a film set in a North African city during WWII, featuring a cynical cafe owner, a freedom fighter, and a woman torn between two men, with a dramatic airport ending.",
        "Classic black and white movie plot summary involving stolen letters of transit, a famous resistance leader, and a romantic triangle in a wartime European refugee hub with a memorable piano song.",
        "I'm looking for a film where a bitter bar owner in a Vichy-controlled city in December 1941 finds himself entangled with a former lover and her husband, a Czech resistance leader, trying to escape to Lisbon, culminating in a sacrifice at an airfield.",
        "Tell me about a vintage romance and espionage movie where a neutral club owner helps a revolutionary escape the Nazis with his wife, who is the owner's past love, involving a corrupt police chief and a shootout at an airport, all set against the backdrop of Casablanca during wartime."
    ],
    "tt0109830": [
        "Movie about a simple man from the South who experiences major historical events and meets famous people, focused on his innocent perspective and a lifelong love for a troubled woman.",
        "Film where a character with a low IQ becomes a war hero, ping-pong champion, and shrimp boat millionaire, all while recounting his life story at a bus stop to strangers, emphasizing themes of fate and perseverance.",
        "Seeking a movie where the protagonist unexpectedly finds himself at the center of many significant moments in American history, from the Vietnam War to the rise of personal computing, with a recurring motif of a white feather drifting in the wind representing destiny.",
        "I'm looking for a film about a man who, despite intellectual limitations, achieves extraordinary things and has a profound impact on those around him, including a childhood friend whose life takes a very different and often tragic path. The story features scenes of football, military service, and cross-country running, all woven together through a unique narrative structure told from the protagonist's point of view to various people he encounters in everyday situations. The overarching emotional tone is one of bittersweet nostalgia and a meditation on the unpredictable nature of life and love, culminating in a poignant reflection on family and legacy.",
        "What's that movie about a man who just keeps running for years across the country for no apparent reason, becomes incredibly famous for it, and his journey is interspersed with flashbacks to his extraordinary life that includes fighting in Vietnam, becoming wealthy from shrimping, and a complicated, enduring relationship with his childhood sweetheart who eventually has his child and suffers from a serious illness?"
    ],
    "tt0110912": [
        "Movie about hitmen, a boxer, and a crime boss's wife, featuring a glowing briefcase and a diner robbery. What's that film called?",
        "Searching for a film with non-linear storytelling where seemingly unrelated events, like a diner stick-up by a couple named Honey Bunny and Pumpkin, a boxer double-crossing a crime boss, and hitmen discussing divine intervention after a shooting, all intertwine. It involves a mysterious briefcase that glows, a near-fatal overdose of a crime boss's wife requiring an adrenaline shot to the heart, and a gold watch passed down through generations that becomes crucial to a character's escape after a brutal fight. Also, a 'cleaner' named Wolf shows up to help dispose of a body in a car. What movie has these elements of dark humor, sudden violence, and philosophical discussions among criminals, all set in Los Angeles?",
        "Film where two hitmen argue about biblical passages and miracles, one accidentally shoots someone in a car, and they need a 'fixer' to clean up the mess before a wife comes home. Also involves a boxer who refuses to throw a fight, has a sentimental gold watch, and ends up in a bizarre pawn shop encounter with rednecks and a gimp. What's the name of this movie?",
        "Looking for a movie plot where a boxer, paid to throw a fight, wins instead and then has to retrieve a family heirloom gold watch, leading to a violent confrontation in a pawn shop basement. This is somehow connected to earlier events involving a couple robbing a diner and two hitmen with a mysterious briefcase.",
        "What's that movie with a famous dance scene at a 1950s-themed restaurant, a character accidentally snorts heroin thinking it's cocaine, and there's a memorable speech about Ezekiel 25:17?"
    ],
    "tt0253474": [
        "Movie about a Jewish pianist in Warsaw during World War 2 who loses his family and survives the ghetto, uprisings, and hiding from Nazis, featuring a memorable scene where he plays for a German officer. What is this film called?",
        "Searching for a historical drama film set during the Holocaust focusing on a classical musician's struggle for survival in a devastated city, showcasing themes of resilience, art, and unexpected human connections amidst immense suffering and the destruction of war-torn Europe.",
        "Film plot where a Polish radio pianist endures the brutal Nazi occupation, witnessing the liquidation of the Jewish ghetto and the Warsaw Uprising, surviving starvation and hiding, ultimately being saved by an empathetic German officer after playing a Chopin piece for him in a bombed-out building, and eventually returning to his music career after the war concludes.",
        "What's the name of the movie about a man who plays piano professionally, set in Poland during World War II, where he experiences the full horror of the Holocaust, including the ghettoization of Jews, the loss of his entire family to concentration camps, and various hiding places, eventually encountering a compassionate enemy soldier who helps him in the final days of the war?",
        "Looking for a powerful and emotional true story adaptation about a Jewish musician's harrowing journey through the Nazi occupation of Warsaw, from performing in a radio station at the war's outbreak, to living in the overcrowded ghetto, witnessing unspeakable atrocities, aiding resistance efforts, and ultimately surviving in ruins, concluding with a poignant encounter with a German officer and his eventual return to his passion for music after liberation. This film explores the profound impact of war on individuals and the enduring power of art and humanity against all odds, depicting both the depths of despair and glimmers of hope during one of history's darkest periods, highlighting the sheer will to live and the subtle acts of kindness that can emerge even in the most brutal circumstances."
    ],
    "tt0093779": [
        "What is the story of a young woman kidnapped by an evil prince, who plans to use her death as a way to start a war, while her true love, a farm boy believed dead, tries to save her? The plot involves pirates, sword fights, and a lot of adventure.",
        "In a fantasy movie, a beautiful woman is about to marry a prince she doesn't love, and she is kidnapped by a group of criminals. The true love of this woman, who was thought to be dead, comes back as a mysterious masked man and attempts to rescue her. Can the man, who is also a skilled swordsman, defeat a series of challenges to free his love and defeat the prince?",
        "I’m looking for a film with a plot where a group of mismatched heroes (including a giant, a skilled swordsman, and a clever man believed to be dead) try to rescue a woman from an evil prince. There’s a lot of humor, sword fighting, and some amazing twists. The characters are very memorable, like the one who is seeking revenge for his father’s death. There’s even a battle of wits with poison goblets. What’s the movie called?",
        "Can anyone recommend a fantasy movie where a young woman is forced into a marriage with a prince who wants her dead, but her true love is alive and comes back to save her? There's a memorable scene with a man who says 'As you wish', and a sword fight with a man who says 'You killed my father'. Also, there’s a guy with six fingers who has a dark secret. I need to know what movie this is!",
        "What is the movie where a grandfather reads a book to his sick grandson about a young woman who is kidnapped by an evil prince, and her true love comes back from the dead to rescue her? The film includes a lot of adventure, a group of unique characters like a giant, a skilled swordsman, and a pirate, and a climactic battle where the villain is confronted by a character who says 'Prepare to die'. I’m looking for the name of this film, please!"
    ],
    "tt0071315": [
        "private detective uncovers water scandal in 1930s Los Angeles investigating husband's apparent affair turns into murder mystery leading to shocking family secrets and corruption in city government involving a powerful old man",
        "movie plot where a private investigator hired to spy on a man for infidelity discovers a much larger conspiracy involving water rights, a drought, and a powerful family in a historical California setting with a tragic ending",
        "film about a detective hired by a woman who turns out not to be who she says she is, leading him into a complex web of deceit, murder, and land speculation in a dry, dusty city, culminating in a devastating reveal about incest and a character's death",
        "what's that noir film where a private eye with a bandaged nose gets caught up in a municipal water department scheme and a wealthy family's dark past, featuring a climactic shootout and a cynical famous last line?",
        "storyline of a detective solving a murder related to California's water supply, discovering a massive real estate fraud and a horrifying family secret involving a powerful patriarch and his daughter, ending tragically for the female lead"
    ],
    "tt0083987": [
        "Movie about a lawyer in South Africa who gets thrown off a train for being in a first-class compartment despite having a ticket, then starts a non-violent protest movement against oppressive laws requiring permits for minorities, eventually meeting with a general who admires his methods.",
        "Film depicting the life of an Indian leader who returns to his home country after fighting for civil rights abroad, organizing peaceful resistance against British colonial rule, including urging people to boycott foreign goods and make their own, and facing arrest for his activism, culminating in a massacre at a garden and later a significant march to the ocean to make salt.",
        "What's that historical drama about a revered figure in India who advocates for non-violence, deals with the aftermath of a brutal shooting of protestors by British soldiers, engages in diplomatic talks with British officials about independence, and later struggles to unite different religious groups within his newly independent nation, even resorting to hunger strikes to stop widespread violence?",
        "Searching for a biographical film that starts with an assassination, flashes back to the subject's early experiences with discrimination and his development of non-violent resistance tactics, follows his return to India to lead a movement against a colonial power, highlights major events like a controversial textile boycott and a famous long walk to the sea, and explores the painful partition of a country based on religion, ending with his continued efforts for peace despite personal danger.",
        "Tell me about a powerful movie exploring themes of justice, civil disobedience, and the struggle for national liberation, centered around a charismatic leader who faces down racist laws, inspires millions through peaceful means like burning permits and making salt, endures imprisonment, witnesses horrific violence like the Amritsar massacre, and ultimately grapples with the heartbreaking division of his homeland along religious lines, all while maintaining his unwavering commitment to truth and non-violence until his final moments."
    ],
    "tt0454876": [
        "Movie about a boy who survives a shipwreck with zoo animals, particularly a tiger, on a lifeboat for an extended period, dealing with survival, faith, and a fantastical journey across the ocean.",
        "Film where a young man from India, after a ship sinks, finds himself adrift in the Pacific with various animals including a zebra, an orangutan, a hyena, and a Bengal tiger, facing impossible odds and a unique relationship with the wild.",
        "Searching for a story involving a teenager named after a French swimming pool, his family's zoo in India, a perilous sea voyage to Canada with animals, and a profound philosophical journey on a lifeboat after a disaster at sea, questioning reality and belief.",
        "What's that movie where a Hindu, Christian, and Muslim boy, son of a zookeeper, ends up stranded in the middle of the ocean after his family's freighter sinks, and he has to coexist with a tiger, facing starvation, hallucination, and eventually reaching a mysterious carnivorous island before being rescued in Mexico?",
        "I'm looking for a film about a shipwreck survivor who recounts two vastly different versions of his ordeal at sea, one involving exotic animals and a profound spiritual awakening, and the other a brutal human struggle for survival, leaving the audience to ponder the nature of truth and storytelling."
    ],
    "tt0056923": [
        "woman discovers her apartment empty and husband dead in Paris, then gets entangled with mysterious men seeking stolen money, leading to a dangerous cat-and-mouse game across European landmarks with shifting identities and hidden motives",
        "classic suspense film about a woman whose husband dies, leaving her pursued by dangerous individuals looking for a quarter of a million dollars in missing funds, featuring mistaken identities, thrilling chases, and a charming stranger who may or may not be trustworthy, all set against a beautiful Parisian backdrop with a surprising twist ending involving the true nature of everyone involved and the hidden location of the money.",
        "romantic thriller where a recently widowed woman is caught in a web of international intrigue and espionage, as multiple enigmatic figures claim to be after a fortune her deceased husband supposedly stole, forcing her to discern allies from enemies while navigating a series of perilous encounters and uncovering the truth behind a wartime double-cross, culminating in a dramatic confrontation and the revelation of her leading man's true identity and profession.",
        "What's that old movie where a woman in France is divorcing her husband, then he dies mysteriously and she finds out he was involved with a quarter-million dollar theft during World War II, and now she's being targeted by a group of his former accomplices, one of whom has a hook hand, while a charming man keeps popping up, claiming to help her but also seeming to be involved with the money, leading to a lot of chasing and close calls and plot twists with multiple identities for the main male character?",
        "film about a woman named Regina who plans to divorce her secretive husband, only to find him dead and herself at the center of a quarter-million dollar mystery involving his wartime past and a group of dangerous men who believe she has the money, featuring a suave, constantly renaming stranger who seems to be both helping and pursuing her, escalating the tension through chases in iconic locations like the Paris Métro and Opera House, with the money hidden in an unexpected item and a final reveal about the hero's true role."
    ],
    "tt1454029": [
        "Movie about a young woman in the civil rights era who writes a book exposing the harsh treatment of African American maids by their white employers in Mississippi, focusing on the stories of brave black women who share their experiences despite the danger.",
        "Film about a southern aspiring writer who secretly interviews black domestic workers in the 1960s to publish their stories, highlighting racial injustice and the deep emotional bonds formed between children and their caregivers.",
        "What's that movie where a maid gets fired for using the inside bathroom during a storm and gets revenge by baking a special pie for her mean employer, then helps a journalist write a book about the lives of black housekeepers?",
        "Searching for a movie set in the American South during the civil rights movement, where a young white woman decides to compile a collection of narratives from African American maids detailing their struggles and the indignities they face, including a memorable scene involving toilets on a lawn and a powerful moment where a maid stands up to her racist employer.",
        "I'm looking for a film about a courageous group of black maids who, in defiance of social norms and personal risk, collaborate with a budding author to expose the realities of their daily lives working for white families in the racially charged atmosphere of 1960s Mississippi, exploring themes of resilience, friendship, and the quiet revolution of ordinary people seeking dignity and justice."
    ],
    "tt1205489": [
        "movie about grumpy war veteran in changing neighborhood protecting immigrant family from gang violence leading to his ultimate sacrifice",
        "film where an elderly man haunted by past military experiences develops an unexpected bond with his teenage asian neighbors, teaching the boy how to be a man and defending his sister from gang assault and sexual violence, all while grappling with his own mortality and estranged family, culminating in a final confrontation",
        "story of a retired auto worker and korean war veteran living in a transitioning urban area who initially despises his hmong neighbors but slowly forms a paternal relationship with the teenage boy next door after he attempts to steal his vintage car, eventually sacrificing himself to bring justice to a violent local gang who assaulted the boy's sister, leaving his prized possession to the young man",
        "seeking movie about a curmudgeonly polish-american widower and decorated combat veteran who experiences a profound transformation through his interactions with a vietnamese-speaking family living next door, particularly after the son tries to steal his classic car, evolving from a racist and isolated figure to a protector and mentor, and confessing his sins before a final, selfless act of defiance against local criminals",
        "what's that film about an old, grizzled soldier who lives alone with his dog, attends his wife's funeral, resents his materialistic children, and finds an unlikely connection with a quiet asian teenager and his outspoken sister from a gang-ridden community, eventually confronting the gang responsible for brutalizing the girl, leading to a tragic, redemptive end where he leaves his beloved car to the boy and his house to the church"
    ],
    "tt1135503": [
        "What is the story about a young woman who starts cooking every recipe from an iconic French cookbook to motivate herself and document her progress through a blog?",
        "Which movie tells the story of two women, one in 1950s Paris and one in early 2000s New York, whose lives intertwine over the love of French cooking, despite facing personal and professional challenges?",
        "Is there a film where a writer starts a blog to complete a year-long cooking challenge based on Julia Child's cookbook, all while grappling with her unfulfilling job and struggling marriage?",
        "What movie focuses on a woman in New York who tries to recreate the recipes from Julia Child's cookbook while dealing with difficult life circumstances, including a job in a post-9/11 call center and a rocky relationship with her husband?",
        "Which film depicts two women's parallel journeys, one in post-war Paris and one in post-9/11 New York, as they both struggle with personal dissatisfaction, their relationships, and their shared passion for French cooking?"
    ],
    "tt1515091": [
        "What is the movie where a brilliant detective teams up with his doctor friend to stop a criminal mastermind who is trying to spark a war through strategic assassinations?",
        "Which film involves Sherlock Holmes chasing after a villain who poisons his love interest and uses a series of bombings to manipulate world events for financial gain?",
        "In which movie does Sherlock Holmes confront Professor Moriarty across Europe, leading to a tense battle of wits, a failed assassination attempt, and a dangerous game of chess?",
        "What is the movie where Sherlock Holmes and his companion Dr. Watson are drawn into a complex conspiracy, with the fate of global peace hanging in the balance, and Holmes makes a dramatic sacrifice to defeat his foe?",
        "Can anyone help me find a film where Sherlock Holmes faces his greatest foe, Moriarty, who has a plan to manipulate world leaders, and a shocking twist happens with a character apparently falling off a waterfall?"
    ],
    "tt1285016": [
        "What happens when a Harvard student creates a website to rate women's attractiveness and ends up facing serious consequences for it?",
        "How did Mark Zuckerberg get the idea for Facebook and why did his relationship with Eduardo Saverin fall apart?",
        "Who were the people involved in the legal battles over Facebook's ownership and how did they impact the company's growth?",
        "What were the major challenges faced by Mark Zuckerberg as he expanded Facebook to other universities and started dealing with betrayal from his close friends?",
        "Did Mark Zuckerberg intentionally sabotage his business partner Sean Parker's involvement in Facebook, and what were the repercussions of that decision?"
    ],
    "tt1068680": [
        "man whose life changes after attending a self-help seminar where he vows to say yes to everything leading to hilarious and unexpected situations",
        "movie about a divorced bank employee in Los Angeles who is encouraged to embrace every opportunity, no matter how unusual, leading to a new romance and some federal attention for suspicious activities related to his new lifestyle choices, including learning Korean and giving out unusual loans, ultimately revealing the true meaning of commitment and balance",
        "plot where a negative individual transforms into an optimistic person by agreeing to all requests and invitations, gets into trouble with the FBI due to his new habits, then reconciles with his girlfriend after realizing that saying yes all the time isn't always the best solution, and finds a healthy middle ground for living life to the fullest",
        "film where a sad and lonely man's life turns around after a pivotal decision to accept every chance that comes his way, featuring a quirky love interest who is a singer in an unusual band and a humorous encounter with law enforcement due to his newfound spontaneity",
        "story about a guy who makes a promise to always say yes, leading to career success, new friendships, a relationship with an unconventional woman, a bizarre run-in with the FBI, and eventually learning that true happiness comes from a balanced approach to life, not just blindly agreeing to everything"
    ],
    "tt0190590": [
        "What happens to a trio of escaped convicts after they flee from a Mississippi chain gang during the Great Depression in 1937? They believe they’ve found a hidden treasure, but things take unexpected turns as they encounter various characters and dangerous situations. What are some of the strange events they face along the way?",
        "In a movie set during the 1930s, three men on the run from the law embark on a journey across rural Mississippi. Along the way, they join a religious baptism, meet a mysterious guitarist, and are pursued by a relentless sheriff. What’s the twist when the trio’s plans start to unravel?",
        "A group of escaped prisoners in the 1930s Mississippi gets involved in a series of bizarre encounters. They face betrayal, deal with a dangerous bank robber, meet a mysterious blind man, and even get mixed up with the Ku Klux Klan. How do these encounters change the course of their escape?",
        "In the midst of the Great Depression, three convicts escape from a chain gang and search for hidden loot. But they end up getting into much more than they bargained for, including a run-in with a Bible salesman, a strange group of women by the river, and a powerful political figure. What is the real reason the main character escapes prison, and how does it impact the story?",
        "What’s the significance of the song 'Man of Constant Sorrow' in the story of a trio of convicts on the run in 1937 Mississippi? They unexpectedly find fame as a band while trying to escape the law and avoid dangerous confrontations, including with the Ku Klux Klan and a vengeful sheriff. How does their music play into their journey and ultimate fate?"
    ],
    "tt1343092": [
        "What is the story of a man who builds a massive fortune and throws extravagant parties in hopes of rekindling a past romance, only for his dreams to end tragically?",
        "I’m looking for a film about a man named Gatsby who throws huge parties in New York, but nobody knows who he really is. He’s obsessed with a woman named Daisy, and things get dark and complicated. What’s this movie called?",
        "Can anyone tell me about a movie where a character named Nick Carraway writes a memoir about his time in New York during the Jazz Age? He meets a mysterious man who lives next door and is obsessed with a woman from his past. The plot involves love, betrayal, and a tragic ending.",
        "In a film set in the 1920s, a young man named Nick Carraway befriends a wealthy businessman named Gatsby, who has a secret past and a deep obsession with a woman named Daisy. It all leads to tragedy after a series of misunderstandings, infidelity, and a murder. Can anyone identify this movie?",
        "I’m trying to find a movie where a man named Nick Carraway tells the story of his interactions with his wealthy neighbor, Gatsby, whose obsession with a woman from his past leads to a shocking death. The movie touches on themes of wealth, social status, and the American Dream. There’s also a dramatic scene where someone is killed by a car, but the wrong person is blamed. What’s the name of this movie?"
    ],
    "tt0155975": [
        "What happened to the woman who stole money from her boss and then fled to a creepy motel, where she was murdered in the shower?",
        "Why did a young man at a small motel pretend to be his mother and kill people? What’s the twist about his mental state?",
        "In a classic horror story, a young secretary steals $40,000 and tries to run away but ends up in a deadly situation at a mysterious motel. What is the significance of the Bates Motel in this story?",
        "How does the psychological story of a man who kills in the persona of his deceased mother unfold? What motivates Norman Bates to murder and pretend to be his mother?",
        "What is the backstory behind the creepy Bates Motel, the strange behavior of its owner, and the brutal murder of a woman who was on the run? What’s the secret about his mother and how does it impact the plot?"
    ],
    "tt0983193": [
        "Movie about a young reporter with a dog who uncovers a secret about a model ship, leading to a treasure hunt involving a diabolical villain, a drunken captain, and bumbling detectives.",
        "Film plot involving an ancient family curse, a lost shipwreck called The Unicorn, and a chase across the world from high seas to deserts to find a vast fortune.",
        "Story of a curious journalist and his loyal dog investigating a stolen miniature ship, facing kidnapping, plane crashes, and battling a descendant of a pirate for hidden treasure.",
        "What's that animated adventure movie where a smart young man, his dog, and a boozy sea captain follow clues from an old parchment to locate a legendary pirate's treasure and uncover a family feud spanning centuries?",
        "Seeking a movie about a Belgian reporter in the 1950s who buys a model ship that triggers a dangerous quest for a hidden fortune and an encounter with a villain linked to a historical pirate, featuring escapes from kidnappers and solving cryptic puzzles."
    ],
    "tt1706593": [
        "Found footage movie about teenagers who gain telekinetic powers after encountering a mysterious object.",
        "Film where high school friends develop superpowers, starting with pranks but escalating to destructive and violent behavior, especially one character struggling with a difficult home life and anger issues.",
        "What's that dark, found-footage style superhero origin story where three male friends get abilities from a strange crystal in the woods, leading to one of them becoming increasingly unstable, hurting people, and eventually fighting his cousin in a destructive city battle?",
        "Searching for a dramatic sci-fi film about a bullied teenager who gains superhuman powers, deals with an abusive alcoholic father and a sick mother, and whose increasing rage causes tragic consequences for his friends and himself, culminating in a powerful showdown.",
        "Movie plot involving high school students in Seattle who discover a glowing blue object underground, granting them telekinetic powers, and chronicles one boy's descent into darkness as he struggles with family problems and the uncontrolled escalation of his abilities, ultimately leading to a confrontation with his last remaining friend."
    ],
    "tt1389137": [
        "Grieving widower buys dilapidated zoo with children, faces financial struggles and difficult son, ultimately finds healing and new love.",
        "Movie about a single father and his kids who move into a house that comes with a failing zoo, trying to reopen it and dealing with family issues and a romance with the head zookeeper.",
        "What's that film where a man buys a house that unexpectedly includes a zoo that's been closed for years, and he has to renovate it to reopen, while also dealing with his son's rebellious phase after their mother's death and a strict inspector, eventually using his deceased wife's inheritance to save the project and finding new courage and connection?",
        "Family movie where a dad and his kids move to a property with wild animals, struggles to run a zoo they inherited with the house, overcomes financial problems and a storm before a grand re-opening, featuring a challenging teenager, a supportive daughter, and a romantic interest for the father.",
        "Story about a man restarting his life after his wife passes away, moving his family to a new home that happens to be attached to an old, rundown zoo, and the challenges they face trying to bring the zoo back to life, including difficult inspections, money troubles, and personal growth for both the father and his children, leading to a heartwarming resolution and a new relationship."
    ],
    "tt1694020": [
        "Road trip comedy movie about a mother and son.",
        "Film about an inventor trying to sell his eco-friendly cleaning product, traveling across the US with his overbearing but well-meaning mother.",
        "What's that funny movie where a son takes his mother on a cross-country business trip, secretly planning for her to reunite with an old flame, leading to various mishaps, misunderstandings, and heartwarming moments?",
        "Searching for a comedy-drama about an adult son and his mother, set on a road trip where she meddles in his life and he tries to improve hers, including a funny scene involving a giant steak challenge and a surprising reveal about a past love.",
        "A movie about a California-based entrepreneur who, struggling to sell his organic cleaning product, embarks on a journey with his New Jersey mother, encountering snowstorms, strip clubs, and a memorable Home Shopping Network presentation where he drinks his own product to prove its safety, all while the mother is unknowingly being led to reconnect with a high school sweetheart."
    ],
    "tt0881320": [
        "Movie about a father and son exploring a dangerous cave system, trapped by a storm, facing treacherous conditions and personal conflicts.",
        "Film where cavers get stuck deep underground after a cyclone hits, forcing them to find a new exit through unexplored underwater passages, dealing with dwindling supplies, injuries, and a growing sense of desperation.",
        "Story of a high-stakes cave expedition gone wrong in Papua New Guinea, where a team battles the elements and internal strife, including a tragic drowning, a mercy killing, and a horrifying act of cannibalism, all while trying to survive and find a way out to the sea.",
        "What's that survival movie where a group of divers and climbers are exploring a massive, uncharted cave system, and a storm floods their entry point, leading to a perilous journey through unknown underwater tunnels, with characters making agonizing sacrifices and facing their darkest fears as they attempt to reach the ocean?",
        "I'm looking for a film about a group of spelunkers, including a strained father-son duo, who become trapped in one of the world's most immense and challenging cave networks, encountering fatal accidents, psychological breakdowns, a desperate dive through a cannibalized body, and a final, almost miraculous escape to a sunlit beach after enduring unimaginable hardship and loss, all while trying to navigate the complex and unforgiving subterranean environment."
    ],
    "tt0822832": [
        "Movie about a couple and their mischievous dog.",
        "Film about a family's life, chronicling their challenges and joys through the perspective of their extremely unruly but beloved yellow Labrador retriever.",
        "What's that heartwarming but sad movie about a couple who adopt a very untrainable dog, and he becomes the subject of a newspaper column as they navigate marriage, raising children, and ultimately, dealing with the dog's old age and illness?",
        "Searching for a family drama centered around a newspaper columnist whose career takes off due to writing about the chaotic antics of his hyperactive Labrador, covering themes of new parenthood, career changes, and the profound impact of a pet on a family over many years.",
        "A movie plot involving a married couple moving to Florida, where the husband becomes a successful newspaper columnist by chronicling the hilarious and destructive behavior of their untrainable yet endearing dog, with the storyline spanning their struggles with fertility, raising three children, relocating for career opportunities, and eventually facing the heartbreaking loss of their beloved canine companion."
    ],
    "tt0319061": [
        "Movie about a dying father who tells tall tales.",
        "Film where a son tries to understand his dying father by separating fact from elaborate fictional stories about his adventurous life.",
        "What's that fantasy drama about a man's life recounted through exaggerated, fantastical stories involving a witch, a giant, a hidden town, and a circus, all while his skeptical son tries to uncover the truth before his father dies?",
        "Searching for a film with flashbacks about a charismatic storyteller father and his estranged son, where the son eventually comes to terms with his father's embellished life story, realizing the value of imagination and the bond they shared.",
        "A movie plot centered on a son's reconciliation with his terminally ill father, who has always told incredible, seemingly untrue stories about his past adventures, including meeting mythical creatures and unique characters, leading the son to retrace his father's steps and ultimately understand that the fantastical narratives were a way of making his ordinary life extraordinary."
    ],
    "tt0352248": [
        "Boxing movie Great Depression comeback.",
        "Film about a retired boxer who makes an unexpected return to the ring during hard economic times to support his family.",
        "What's that inspiring true story movie set in the Great Depression about a former light heavyweight boxer who becomes known as \"Cinderella Man\" after a miraculous winning streak against younger, tougher opponents?",
        "Searching for a historical sports drama portraying a down-and-out boxer working manual labor during the Great Depression, who, against all odds, gets a second chance at fighting and becomes a symbol of hope for the common people.",
        "A movie plot depicting a former professional boxer in New York/New Jersey during the 1930s who, after a career-ending injury and financial struggles, stages an incredible comeback against the odds, culminating in a championship fight against a dangerous opponent known for killing men in the ring, all to provide for his wife and children."
    ],
    "tt0019884": [
        "Movie about an airline pilot who is a drug addict and alcoholic, but heroically crash-lands a plane, saving most of the passengers, only to face an investigation that uncovers his substance abuse issues before the flight.",
        "Film where a pilot successfully inverts a failing plane to prevent a complete disaster, struggles with addiction, and eventually faces a federal hearing about his actions.",
        "What's that movie about a commercial airline pilot with a secret drug and alcohol problem who miraculously lands a severely damaged plane, but then his past catches up to him during the official investigation, forcing him to confront his demons and ultimately leading to a powerful confession?",
        "What's that movie where a highly skilled but troubled airline captain, who abuses alcohol and cocaine, saves most of his passengers by performing an incredible inverted flight maneuver during a catastrophic mechanical failure, and then has to confront his demons and a federal investigation into his conduct, leading to a powerful confession and eventual incarceration for his actions, all while trying to reconcile with his estranged family?",
        "Search for a movie plot where a seasoned airplane captain, battling severe personal demons involving drugs and alcohol, somehow manages to perform an extraordinary emergency landing of a commercial jet after a mechanical failure, saving many lives, only for his actions and condition prior to the flight to be meticulously scrutinized by investigators, leading to a dramatic revelation and a path towards sobriety while facing the consequences of his choices."
    ],
    "tt0109445": [
        "Comedy about convenience store clerks.",
        "Film set in a convenience store featuring two slacker friends and a day filled with bizarre customers and personal drama.",
        "What's that independent black and white comedy from the 90s about a video store clerk and his friend who works next door, spending a single day discussing pop culture, dealing with quirky customers, and navigating their messy love lives?",
        "Searching for a cult classic movie where a guy is called into work at a convenience store on his day off, leading to a series of escalating comedic and dramatic events involving his girlfriend, his ex, and his sarcastic best friend.",
        "A movie plot depicting a single chaotic day in the life of a New Jersey convenience store clerk who is forced to work on his day off, where he grapples with a bizarre array of customers, argues with his girlfriend about past relationships, deals with his cynical video store employee friend, and experiences a series of personal crises and absurd events, all while repeating \"I'm not even supposed to be here today!\""
    ],
    "tt1637688": [
        "Movie about a future society where people stop aging at 25 but only have one year to live, and time itself is the currency for everything from rent to food. What is the name of this film where the rich are virtually immortal and the poor die young?",
        "Looking for a film where a man from the ghetto inherits a large amount of time and tries to expose the unfair system where the wealthy hoard centuries while others struggle for minutes, involving a high-speed chase and a daring bank robbery.",
        "I'm trying to find a dystopian movie where a young man's mother dies because she can't afford bus fare and he then decides to fight against a corrupt economic structure, ultimately teaming up with a rich woman to redistribute wealth.",
        "What's that science fiction movie where everyone has a glowing digital clock on their arm counting down their remaining lifespan, and a rebellion starts when a protagonist tries to break the system by giving time away to the poor?",
        "Film plot where a man is framed for murder after receiving a vast amount of time from a suicidal stranger, leading him and a hostage from the wealthy elite on a cross-country journey to dismantle a societal structure built on extreme time-based inequality, culminating in a dramatic heist of centuries of time from a central bank."
    ],
    "tt1010048": [
        "Movie about an Indian game show contestant.",
        "Film where a young man from the Mumbai slums is accused of cheating on \"Who Wants To Be A Millionaire?\"",
        "What's that movie about an 18-year-old orphan from India who is interrogated by police after correctly answering almost every question on a game show, and his life story reveals how he knew the answers?",
        "Searching for a film that interweaves the narrative of a boy's difficult life in the slums of Mumbai, including his bond with his brother and his lost love, with the answers to questions on a popular television quiz show.",
        "A movie plot about a poverty-stricken orphan in India who becomes a contestant on a major game show, and as he recounts his extraordinary life experiences – from escaping gangs and living on the streets to searching for a childhood sweetheart – each memory provides the unlikely solution to a game show question, all while he's suspected of cheating."
    ],
    "tt0061722": [
        "Recent college graduate feels lost and has an affair with an older, married woman who is friends with his parents. He then falls for her daughter. What movie is this where a young man is seduced by an older woman and then finds himself entangled with her family, leading to a dramatic escape from a wedding?",
        "Film about a confused college graduate's summer of illicit romance, generational conflict, and a desperate attempt to stop a wedding.",
        "Movie plot where a young man fresh out of college is drawn into an affair with an older, manipulative married woman, then tries to pursue a relationship with her daughter despite the mother's threats, culminating in a chaotic church scene and an escape on a bus.",
        "Seeking a movie about a 20-something man's post-graduation ennui, his scandalous relationship with an older family acquaintance, and his eventual love for her daughter, leading to a dramatic chase and a last-minute disruption of a wedding ceremony.",
        "I'm looking for a movie where a privileged but aimless young man, just out of college, is drawn into a highly unconventional and illicit relationship with a sophisticated older married woman, whose husband is his father's business partner; the plot then thickens as he develops genuine feelings for the older woman's daughter, leading to intense family drama, public confrontation, and a memorable, chaotic sequence at a wedding where he tries to run away with the bride, exploring themes of generational conflict, sexual awakening, and the search for identity."
    ],
    "tt0097576": [
        "Young adventurer's origin story involving a precious artifact, a circus train escape with snakes and a lion, a distinctive chin scar, and a difficult relationship with his academic father who is obsessed with ancient drawings.",
        "Search for a historical relic said to grant immortality, involving an archaeologist, his estranged father, a mysterious female assistant, and a dangerous journey through European catacombs, a Venetian library, and a German castle while being pursued by nefarious organizations.",
        "Movie about a scholar attempting to rescue his kidnapped father and locate a legendary holy artifact, featuring elaborate booby traps, desert chases with a tank, a betrayal by an associate, and a climactic choice in a hidden temple that determines life or death.",
        "What's that film where a professor uncovers a secret society, battles against a wealthy benefactor who wants an ancient powerful item for himself, and faces moral dilemmas about the pursuit of eternal life, all while navigating a complex relationship with his intellectual but distant father?",
        "Adventure movie featuring a daring escape from a dirigible, a bizarre aerial combat sequence with seagulls, a confrontation with a historical dictator at a book burning, and a final quest for a legendary cup that promises everlasting life, with themes of greed, redemption, and the bond between a father and son."
    ],
    "tt0421715": [
        "Movie about a man aging backwards born old in New Orleans.",
        "Film about a man who ages backwards, falls in love with a ballerina, set against a backdrop of a storm, with a diary revealing his life story read by a daughter to her dying mother in a hospital during Hurricane Katrina.",
        "Movie with a clock that runs backwards built by a grieving clockmaker after World War I, tied to a story of a man aging in reverse in New Orleans, with themes of love and loss.",
        "Movie set in New Orleans with a backward-aging man who falls in love with a ballerina and faces war and loss.",
        "Film about a clock running backwards, a man growing younger, and a strained mother-daughter relationship revealed through a diary during a hurricane."
    ],
    "tt0970179": [
        "Orphan boy living in Paris train station maintaining clocks tries to fix a mechanical man he believes holds a message from his deceased clockmaker father.",
        "Movie about a young boy, a runaway in 1930s Paris, who spends his days secretly fixing intricate clockwork mechanisms within a bustling railway station and becomes entangled with an old, reclusive toy shop owner and his goddaughter, leading to the rediscovery of a forgotten cinematic pioneer.",
        "What is that charming film set in a large Parisian train station where a resourceful young orphan boy evades a persistent inspector, steals mechanical parts to repair a broken automaton, and uncovers the hidden legacy of a disillusioned filmmaker, eventually restoring his reputation?",
        "Story of a young boy who lives alone in the walls of a Parisian train station, obsessed with repairing an old automaton inherited from his late father, a project that leads him to encounter a melancholic toy vendor and his goddaughter, revealing a surprising connection to early cinema history and bringing recognition to a forgotten artist's groundbreaking work in special effects.",
        "Film featuring a clever orphan boy in an early 20th-century European city who meticulously maintains the massive clocks of a grand railway station, all while working to fix a mysterious automaton, only to cross paths with a gruff toy shop owner who turns out to be a key figure in the history of silent movies, ultimately helping to rekindle his passion and celebrate his contributions to the art form."
    ],
    "tt0330373": [
        "Movie where teenagers at a magical boarding school compete in a dangerous international tournament, featuring dragons, underwater challenges, and a mysterious maze.",
        "Film about a magical competition between three schools, one of the champions is unexpectedly chosen despite being underage, leading to suspicion and a rift with a friend, and eventually uncovering a dark plot involving a resurrected villain and an imposter teacher.",
        "What's that fantasy movie where a young wizard has to battle a dragon, retrieve something from a black lake inhabited by merpeople, and navigate a treacherous maze, all while dealing with a jealous best friend and a shocking reveal about one of his new teachers?",
        "I'm looking for a film plot summary that involves a magical world cup, a dangerous tri-school wizarding tournament with three deadly tasks including fighting a dragon and an underwater rescue mission, a formal winter ball causing friendship drama, and a major twist ending revealing a powerful dark wizard's return through a portkey and a secret identity of a new defense against dark arts professor.",
        "Search for a movie where a chosen one, still underage, is forced into a prestigious and deadly magical tournament alongside champions from other schools, struggles with tasks like facing a dragon and retrieving items from merpeople, experiences a falling out with his best friend over jealousy, uncovers a conspiracy involving a dark wizard's return and a Death Eater posing as a respected professor, and ultimately witnesses a tragic death during the final task."
    ],
    "tt1033575": [
        "Movie about a father in Hawaii who reconnects with his estranged daughters after his wife suffers a tragic boating accident and is left comatose, forcing him to navigate difficult family dynamics and make life-altering decisions about their shared future and a significant land trust.",
        "Film where a man discovers his comatose wife had an affair and he seeks out her lover to give him a chance to say goodbye before she's taken off life support, all while dealing with his rebellious teenage daughter and young child in a tropical setting.",
        "Story of a Hawaiian land trustee grappling with his wife's terminal coma, her secret affair, and the complex decision of whether to sell off vast ancestral lands or preserve them for future generations, ultimately choosing a different path than his family expected.",
        "What's that movie about a family in Hawaii dealing with grief and betrayal after the mother's accident, featuring a father trying to bond with his difficult daughters, uncovering his wife's infidelity, and making a controversial decision about valuable family property on a beautiful island?",
        "I'm looking for a film about a man who has to take care of his two daughters after his wife is in a boating accident and left in a coma, where he uncovers her affair and confronts the lover, all while facing a massive family decision about selling off a huge piece of land in Hawaii, concluding with a poignant scene of the family healing together."
    ],
    "tt1270798": [
        "Movie where boy's metal-bending powers are unleashed by a scientist who kills his mother, leading to a lifelong conflict with a telepathic friend and a global conspiracy involving a nuclear standoff during the Cold War.",
        "Film where a powerful telepath and a man with magnetic abilities form a team of young mutants to stop a villain who absorbs energy and wants to start a nuclear war during the Cuban Missile Crisis, featuring a scene where a character gets shot in the spine.",
        "What's that movie where a character named Erik is tormented by a Nazi scientist, develops metal manipulation powers, and later seeks revenge, eventually leading to a confrontation during a Cold War stand-off involving missiles and submarines, with a significant part of the plot focusing on the origins of a wheelchair-bound telepath and his shapeshifting foster sister?",
        "Story of two powerful individuals, one with mind control and the other with control over metal, who are initially friends but diverge due to differing ideologies on human-mutant relations, set against the backdrop of the 1960s with themes of prejudice, revenge, and the formation of a secret team of enhanced individuals.",
        "Search for a movie involving a German concentration camp, a scientist who experiments on a young boy with unique abilities, a mansion in New York with a telepathic boy and a blue girl, a CIA agent, a group of extraordinary individuals fighting against a powerful mutant who tries to ignite a global conflict, and a pivotal moment where a character is paralyzed by a bullet, leading to the formation of a special school."
    ],
    "tt0304141": [
        "Movie where boy wizard inflates abusive aunt and later discovers his godfather, a supposed mass murderer, is actually innocent and an unregistered animal-shifter, all while learning to defend himself from happiness-draining creatures.",
        "Seeking a film where a magical boarding school student learns to defend against soul-sucking creatures, confronts a dark past connected to his parents' supposed betrayer, and unravels a complex mystery involving animagi and a hidden villain.",
        "I'm looking for a movie with a boy wizard who has a mysterious encounter with a large black dog, travels on a whimsical, enchanted bus, and faces a menacing creature called a Dementor on a train, leading to a crucial lesson in magic from a new, intriguing professor who has a secret. The plot involves a supposed murderer breaking into a secure magical school, the use of a magical map that shows real-time locations, and a climactic sequence where the protagonist learns the truth about his godfather's innocence, involving a seemingly harmless pet rat and a daring rescue from prison and execution, all while dealing with personal fears and the looming threat of a dark lord's return, culminating in a powerful display of defensive magic and a significant change in the protagonist's understanding of his past and future.",
        "What's that fantasy movie where a student at a magical academy has a terrifying encounter with soul-sucking guardians on a train, later learns about a notorious fugitive who was his family's secret keeper, and eventually uses a magical map and a time-bending device to uncover a conspiracy involving an old friend disguised as a household pet?",
        "I'm looking for a film where a young wizard deals with the fallout of accidentally using magic on his aunt, leading him to a wild bus ride and the revelation that a dangerous escaped prisoner is hunting him, but the real threat turns out to be a long-thought-dead individual who framed an innocent godfather, all explored through lessons on fear-manifesting boggarts and defensive spells against cloaked, chilling beings."
    ],
    "tt1396218": [
        "movie where a businessman inherits penguins from his adventurous father and they mess up his fancy city apartment and business deals.",
        "film about a divorced real estate mogul who struggles to bond with his kids until a group of mischievous penguins arrive, transforming his life and leading him to choose family over career ambitions.",
        "plot details for a comedy about a work-obsessed man who suddenly finds himself living with several penguins, impacting his relationship with his estranged family and a significant property acquisition, ultimately leading him to a heartwarming realization about what truly matters.",
        "searching for a family-friendly movie featuring a high-flying real estate agent whose life is turned upside down by an unexpected inheritance of arctic birds, causing chaos in his upscale New York apartment and forcing him to reevaluate his priorities regarding his children, ex-wife, and a historic restaurant he's trying to acquire for demolition, culminating in a dramatic attempt to rescue the birds from a zookeeper and a new appreciation for his father's legacy and the simple joys of life.",
        "what's the movie where a busy real estate developer, whose father was a global adventurer, receives a penguin as an inheritance, and then more penguins show up, leading to comical mishaps in his apartment, a rekindled relationship with his children and ex-wife, and a conflict with a persistent zookeeper while he's trying to close a major deal to tear down an old restaurant, eventually resulting in a big change of heart and a trip to Antarctica with his new feathered friends?"
    ],
    "tt0167404": [
        "What's that movie where a prominent child psychologist takes on a new case with a young boy who claims to see deceased people walking among the living, and the therapist's dedication to this patient, born from a haunting past failure, leads him to neglect his own marriage, culminating in a profound and unexpected twist about his own existence after he helps the boy uncover the truth about a ghost's death by poison and finally communicates with his estranged wife while she sleeps?",
        "What's that psychological thriller where a doctor is grappling with the consequences of a past failure involving a patient, and he takes on a new case with a young boy who has a similar, unsettling gift, ultimately discovering a dark secret about one of the spirits and finding peace through his interaction with the child?",
        "Story of a gifted child who provides closure to lingering spirits, assisting a deceased psychologist in understanding his own fate and finding peace after a tragic event, all while dealing with personal family revelations.",
        "Film where a young boy can see and talk to ghosts, including a girl who died mysteriously, and he helps them resolve their unfinished business, leading to a shocking revelation about his own therapist.",
        "Film about a young boy with a terrifying secret ability to see deceased individuals, and a doctor trying to understand him, leading to a shocking revelation about the doctor's own fate."
    ],
    "tt0113161": [
        "mobster leaves Florida for Hollywood to chase down a debt and gets involved in the movie business, trying to produce a film while dodging various criminals and federal agents, eventually faking a real-life scenario for a movie ending.",
        "loan shark with a stolen coat travels from Miami to Los Angeles, dealing with a presumed dead debtor who faked his demise, then gets entangled with a struggling film producer, an arrogant actor, and dangerous drug dealers, all while trying to finance a movie based on his own adventures.",
        "guy who collects money gets mixed up with a con artist faking his death, travels across the country, ends up in the film industry, and has to deal with a big drug lord, a jealous ex-boss, and a kidnapping, all leading to a surprising twist about what's real and what's part of a film.",
        "movie about a tough guy from the East Coast who comes to California, gets involved with movie producers, actors, and gangsters, has a knack for handling dangerous situations with wit and charm, and uses his experiences to create a new film, where the lines between reality and fiction blur.",
        "character who works for a gangster finds himself in a series of escalating conflicts, starting with a dispute over a stolen coat, moving to a fake death insurance scam, then a struggle for control over a movie project, culminating in a violent confrontation with a drug cartel and a former associate, with a meta-narrative reveal at the end."
    ],
    "tt0926084": [
        "What is the movie about a group of young magic users searching for powerful dark artifacts to defeat an evil wizard, where they have to disguise themselves and break into a heavily guarded government building, and one of them temporarily leaves the group due to emotional strain?",
        "Looking for a film where a powerful dark wizard takes over a magical school and the main characters are on the run, trying to find objects that are pieces of the dark wizard's soul. There's a scene where multiple people drink a potion to look like the main character to confuse enemies during an escape.",
        "Movie plot search: magical trio on the run after a wedding is attacked, they investigate a mysterious symbol, one character gets injured, and they later discover a secret society with three powerful legendary items. Features a dangerous break-in at a corrupted magical government and a tragic sacrifice by a house elf.",
        "I'm trying to find a movie about a chosen one and his friends hunting down magical items to destroy a powerful dark lord. Key scenes involve a dangerous infiltration of a government ministry using disguises, a character being tortured, and a crucial decision to visit the protagonist's birthplace, leading to a confrontation with a shapeshifting creature.",
        "Search for a fantasy film with a storyline about a young man and his two close companions embarking on a quest to destroy fragmented parts of an evil sorcerer's essence. The journey is fraught with peril, including battles with dark followers, the loss of allies, internal conflict within the group leading to a temporary separation, and the discovery of legendary magical artifacts tied to a family history. The climax involves a daring rescue from a dark manor and a significant death, all culminating in the dark lord obtaining a powerful, ancient wand."
    ],
    "tt0103074": [
        "Two female friends on a road trip, one timid and one headstrong, get into trouble after an attempted assault at a bar leads to a shooting, changing their lives forever and forcing them on the run from the authorities.",
        "Movie about women escaping an abusive past, finding freedom on the open road, committing crimes including robbery and property destruction, and ultimately making a defiant last stand against the police at a canyon's edge.",
        "Plot summary of film where a quiet housewife and her independent friend go on a weekend getaway that spirals into a cross-country flight from the law after a violent incident, leading to a series of escalating confrontations and a dramatic, final act.",
        "Tell me about a film featuring two women who leave their mundane lives for an adventure that turns dark when they're involved in a crime, leading them to empower themselves through a series of rebellious acts, and building an unbreakable bond as they face an inevitable end.",
        "What's that movie where two women, a timid one with an overbearing husband and her confident, unmarried friend, embark on a vacation that becomes a desperate chase from the police after an act of self-defense, exploring themes of female liberation and fighting against a patriarchal society, culminating in a memorable and tragic climax at a cliff?"
    ],
    "tt0169547": [
        "Film about a suburban patriarch who experiences a dramatic shift in his perspective on life after becoming infatuated with a teenager, leading him to abandon his mundane existence, while his wife seeks fulfillment in an affair and his daughter finds an unusual connection with a new neighbor, whose strict military father harbors a secret, all intertwined with themes of unrequited desire, family dysfunction, and the pursuit of happiness, ultimately concluding with a violent act and a profound, lingering sense of peace from the deceased narrator.",
        "Story of suburban discontent featuring a father's reinvention, a wife's infidelity, and a daughter's relationship with a peculiar neighbor, exploring themes of societal expectations, self-liberation, and hidden desires, ending with an unexpected death and a reflective, almost serene voice-over about life's moments.",
        "What's that movie where a disillusioned advertising executive becomes obsessed with his daughter's friend, leading him to drastically change his life, including smoking marijuana and working at a fast-food joint, while his wife starts an affair and his daughter falls for a strange, camcorder-obsessed neighbor whose father is a bigoted military man, culminating in a tragic shooting?",
        "What's that movie where a seemingly ordinary family unravels, the father finds himself reinvigorated by an inappropriate crush, the mother has an affair with a business rival, and the daughter forms an unexpected bond with a strange, film-obsessed boy next door, culminating in a violent act and a surprisingly reflective narration from beyond the grave?",
        "Story about a man who becomes infatuated with his daughter's friend, leading to a series of shocking events including infidelity, blackmail, and a tragic death, all while his conservative military neighbor misinterprets his son's actions."
    ],
    "tt1124035": [
        "What happens in a political campaign movie where a young, idealistic staffer gets entangled in a scandal involving a presidential candidate, a pregnant intern, and backstabbing between rival campaign managers?",
        "Looking for a film about the dark side of presidential campaigns, focusing on a press secretary who uncovers a secret affair between his candidate and a young intern, leading to tragic consequences and a power struggle within the campaign team, exploring themes of loyalty, ambition, and political corruption.",
        "Movie where a junior campaign manager in a Democratic primary discovers his charismatic governor candidate had an affair with a 20-year-old intern who later gets pregnant and then dies by suicide, leading the staffer to blackmail the candidate for control of the campaign.",
        "Political drama about a communications director working for a popular presidential hopeful who finds himself caught in a web of lies, manipulation, and moral compromises when he learns about his boss's hidden indiscretions, ultimately forcing him to make a difficult choice between his ideals and his career, showcasing the cutthroat nature of American politics and the rapid loss of innocence for those involved.",
        "Film plot involving a high-stakes US presidential primary election, a rising political operative, a manipulative opposing campaign manager, a journalist seeking a scoop, and a tragic storyline involving a young female intern, with a focus on how power, secrets, and personal ambition can destroy idealism and lead to unexpected, devastating outcomes for all involved."
    ],
    "tt1446714": [
        "Movie where archaeologists find a star map in a cave in Scotland, leading them to a distant moon where they discover giant humanoid aliens who might be humanity's creators.",
        "Movie where archaeologists find a star map in a cave in Scotland, leading them to a distant moon where they discover giant humanoid aliens who might be humanity's creators.I'm trying to remember a movie about a crew's desperate struggle on an alien moon after discovering that the extraterrestrial beings responsible for life on Earth also developed a deadly black liquid intended for humanity's annihilation, culminating in a dramatic space battle and the birth of a familiar, terrifying alien creature from one of the \"Engineers\" after a catastrophic crash.",
        "What's that movie about an expedition to a moon called LV-223, where a crew encounters giant humanoids in bio-mechanical suits, finds archives showing an emergency, and an android secretly infects a crew member, leading to a terrifying birth and a struggle to prevent the aliens from unleashing a biological weapon on Earth?",
        "Movie plot involving a deep space mission to LV-223, a planetoid with pyramid-like structures, where a team uncovers the remains of giant humanoids and ancient holographic recordings, and later faces a rapidly evolving alien pathogen, leading to grotesque births and the realization that their supposed creators intended humanity's destruction.",
        "Seeking a science fiction horror movie where a female archaeologist, despite being sterile, becomes pregnant with a monstrous creature after her partner is infected by an alien substance, forcing her to perform a gruesome self-surgery to remove it, all while uncovering a conspiracy by her mission's benefactor and fighting to escape a crashed alien spacecraft."
    ],
    "tt1570728": [
        "Movie about a guy whose wife cheats and wants a divorce, then he learns to pick up women from a young womanizer.",
        "Film where a divorced dad gets seduction lessons from a playboy, but struggles with his feelings for his ex-wife while his son has a crush on the babysitter.",
        "Romantic comedy about a middle-aged man rebuilding his life after a divorce, mentored by a charming young guy, with a twist involving his daughter’s new boyfriend.",
        "Movie set in a suburban town where a man, heartbroken after his wife’s affair, transforms into a ladies’ man with help from a bar friend, only to face family drama at a backyard party.",
        "Story of a guy dealing with a crumbling marriage, learning to seduce women from a smooth-talking younger man, while his teenage son pines for the babysitter and a surprising family connection unravels at a mini golf gathering."
    ],
    "tt0988595": [
        "A humorous yet heartfelt movie featuring a protagonist who meticulously organizes countless weddings for friends and family, stores all her hideous bridesmaid dresses, and grapples with complicated sibling rivalry and a blossoming relationship with a cynical writer, culminating in a dramatic public confession of love at a wedding.",
        "I'm looking for a film about a dedicated personal assistant who sacrifices her own desires for others, including helping her sister plan a wedding, only to discover a shocking truth about her long-time crush and find love with an unexpected person.",
        "Looking for a movie about a kindhearted woman who always puts others first, particularly when it comes to wedding planning, but eventually learns to stand up for herself and prioritize her own happiness after a series of chaotic events and a revealing newspaper feature about her extensive bridesmaid history, leading her to discover love with an unexpected person.",
        "What's that movie about a woman who has been a bridesmaid 27 times, collecting all the dresses, gets into a verbal sparring match with a commitment-phobic reporter who ends up writing about her, and has to deal with her younger sister falling for the man she secretly loves, culminating in a public confession of feelings at a wedding?",
        "Romantic comedy plot where a meticulous assistant with a hidden crush on her employer has her life complicated when her free-spirited sister comes to town and starts dating the boss, leading to a dramatic wedding planning mishap involving a family heirloom dress and a tell-all newspaper article."
    ],
    "tt1230414": [
        "Movie about a successful bakery owner whose ex-husband, a lawyer, starts an affair with her after their son's college graduation, despite him being remarried to a much younger woman.",
        "Film where an architect falls for a divorced woman who is having a secret relationship with her ex-husband, leading to romantic complications and humorous misunderstandings among their adult children.",
        "What's that comedy-drama about a mature woman rediscovering romance and her sexuality, juggling a surprising rekindled flame with her former spouse and a new, charming suitor, all while her grown kids react to the chaos?",
        "Searching for a film plot involving a prominent female character who owns a bakery, whose comfortable single life is upended when her philandering ex-husband re-enters the picture, causing emotional turmoil and a surprising new relationship with an unexpected person, ultimately forcing her to choose between past comfort and future possibilities.",
        "Storyline of a movie where a divorced couple, ten years after their separation, rekindle their physical relationship during their son's college graduation trip, leading to a complicated affair, a jealous new wife, and an emerging romance with a kind architect, exploring themes of second chances, family dynamics, and finding happiness later in life."
    ],
    "tt0043456": [
        "Movie where an alien comes to Earth in a spaceship, initially seen as a threat, but a female scientist and a young boy try to convince it that humanity is worth saving despite its flaws, leading to a major decision about the planet's fate.",
        "Science fiction film about a benevolent alien entity that arrives on Earth, causing global panic and military intervention, but eventually chooses to protect the planet from human destruction after observing acts of compassion, and then leaves behind a world without advanced technology.",
        "Story about an extraterrestrial visitor who emerges from a massive sphere in Central Park, is shot, then rapidly transforms into a human-like form, and after initial hostile intentions to cleanse the planet of humanity, changes its mind due to the influence of a human family, ultimately sacrificing itself and disabling all technology.",
        "What's that movie where an alien ambassador lands on Earth with a powerful robot guardian, intending to reset the planet by destroying humanity, but a brilliant astrobiologist and her stepson show it the value of human life and emotion, leading to a dramatic shift in the alien's mission and a global electromagnetic pulse?",
        "Film plot involving a mysterious alien presence arriving in a giant sphere, a government cover-up, a wise alien entity sent to evaluate humanity, and a young boy's emotional plea that convinces the alien not to wipe out the human race, resulting in a world-altering technological shutdown and the alien's departure embedded within its spacecraft."
    ],
    "tt1284575": [
        "movie about a gold-digging teacher who drinks and takes drugs trying to marry rich, gets dumped, goes back to teaching, and schemes to win another wealthy colleague while her gym teacher coworker pursues her.",
        "storyline where a female teacher attempts to get breast implants to impress a rich substitute teacher, but he's interested in her rival, leading her to manipulate students and parents for money, eventually cheating to win a bonus for her class's high test scores.",
        "film plot where a cynical, uncaring teacher drastically changes her teaching style to help her students pass a state exam for a bonus, also involving her seducing and drugging an official to steal the exam, and later poisoning a rival to get closer to her crush.",
        "looking for a comedy movie description about a corrupt school teacher who blackmails school officials with compromising photos to avoid getting caught for stealing an exam, frames a colleague for drug possession, and ultimately ends up as a guidance counselor.",
        "what's that movie where a lazy, self-centered female teacher, after a series of outrageous schemes to get rich and snag a wealthy man, including academic fraud and petty revenge against a rival, eventually finds a more grounded relationship and a surprising new role at her school, realizing personal growth despite her initial morally questionable actions?"
    ],
    "tt0118715": [
        "cult classic film about a laid-back Los Angeles slacker who gets caught up in a case of mistaken identity involving a millionaire, a kidnapped wife, and a ruined rug, featuring a memorable bowling team.",
        "Searching for a movie where a chill guy in a bathrobe gets his rug peed on, leading to a crazy mix-up with a wealthy namesake, nihilists, and constant bowling. What's that comedy with the chilled-out protagonist who just wants his rug back because it really tied the room together, and his aggressive, Vietnam-obsessed friend?",
        "movie about an unemployed slacker entangled in a convoluted kidnapping plot after a case of mistaken identity, featuring eccentric friends, absurd situations, and a recurring love for White Russians.",
        "I'm trying to find a film from the 90s about a perpetually relaxed dude, possibly named \"The Dude,\" who loves bowling and finds himself embroiled in a bizarre crime involving a millionaire, a missing trophy wife, German nihilists, and a valuable rug that's been desecrated. It has a distinctive quirky, comedic tone and features a character who frequently brings up the Vietnam War.",
        "Query for a dark comedy movie focusing on a slacker's misadventures in Los Angeles, inadvertently drawn into a complex scheme of blackmail and kidnapping due to sharing a name with a wealthy invalid. The film involves a group of unique characters including a short-tempered, rules-obsessed bowler, a quiet sidekick, and an avant-garde artist, all navigating a series of increasingly absurd and chaotic events, often accompanied by scenes at a bowling alley and references to a specific drink."
    ],
    "tt0307987": [
        "What's that movie about a cynical, alcoholic con artist who poses as Santa Claus at a mall to pull off a Christmas Eve heist, but unexpectedly forms a bond with a naive, overweight kid who genuinely believes he's the real Santa? I remember something about him being a sex addict too, and the kid's dad is in jail.",
        "I'm looking for a film where a crooked Santa and his elf partner plan to rob a shopping mall on Christmas Eve. The Santa character is really debauched and inappropriate, which causes problems with the mall manager and security. There's also a storyline about him getting involved with a bartender who has a Santa fetish and a sweet, unsuspecting child.",
        "Help me find a movie about a dysfunctional duo of criminals, one dressed as Santa and the other as an elf, who use their holiday jobs as a cover for their annual Christmas Eve mall robbery. The Santa is a heavy drinker and womanizer, and he ends up living with a peculiar, innocent boy whose father is in prison.",
        "There's a dark comedy about a thief dressed as Santa who reluctantly befriends a bullied, lonely boy. The plot involves a Christmas heist, a corrupt security chief trying to blackmail them, and unexpected character development for the main character as he starts to care for the kid. The setting is a shopping mall during the holiday season.",
        "I need to find the name of that movie where a jaded, foul-mouthed Santa Claus is part of a criminal enterprise, but his life gets complicated by a genuinely good-hearted child who looks up to him. The film features themes of unlikely friendship, redemption, and a botched robbery attempt that leads to a police shootout. There's also a plot point about the Santa getting shot but surviving and going on to help the police."
    ],
    "tt1022603": [
        "romantic dramedy exploring themes of unrequited love, modern relationships, and personal growth, featuring a heartbroken male lead who learns to appreciate the nuances of attraction and commitment after a significant breakup and a chance encounter at a job interview.",
        "film where male protagonist has unrealistic expectations about love and a relationship with a woman who eventually marries someone else, leading him to quit his job and pursue his original passion.",
        "I'm looking for a movie about a non-traditional romance, where the male lead initially idealizes his girlfriend, but after their split and her surprising marriage, he reflects on their history and his own misconceptions about destiny and relationships, culminating in a new beginning with someone unexpected.",
        "What's that movie where the main character thinks he's found \"the one\" because of their shared love for The Smiths, but she later breaks his heart and he learns valuable lessons about love and expectations?",
        "Movie about a man's journey through love and heartbreak, starting with an intense infatuation that doesn't work out, and exploring his eventual realization about relationships and destiny. He meets a girl who changes his perspective, and the story concludes with a hint of a fresh start."
    ],
    "tt0217869": [
        "Movie about a man who survives a train crash without a scratch, discovering he has extraordinary strength and an inability to get sick, guided by a fragile comic book art gallery owner who believes he's found his real-life superhero counterpart, leading to a shocking revelation about the true nature of their connection.",
        "Film where a security guard, seemingly ordinary, learns he possesses superhuman abilities after a devastating accident, with a mysterious, physically frail individual helping him understand his unique gifts, only for the protagonist to uncover a sinister secret about his mentor's involvement in past tragedies.",
        "What's that movie where a seemingly ordinary guy discovers he's invincible after a train derailment, then meets a man with extremely fragile bones who acts as his guide to understanding his powers, culminating in a twist where the fragile man is revealed to be a supervillain orchestrating disasters?",
        "Story about a man who believes he's always been weak, but after a major accident, he realizes he's never been sick or hurt, and a strange, brittle man who collects comic books tries to convince him he's a real-life superhero, leading to the protagonist using his new found abilities to stop crime, only to discover the shocking truth about his mentor's role in the world's disasters.",
        "Search for a movie plot: a protagonist who is a security guard finds out he is invulnerable after a major train accident. He is then contacted by a man with a rare bone disease who believes the protagonist is his opposite and therefore a superhero. The film explores the protagonist's journey of self-discovery, including a weakness to water, and his eventual confrontation with the comic book enthusiast who orchestrated all the disasters to find him."
    ],
    "tt0118842": [
        "Comic book artist falls for a woman, discovers her past sexual experiences, and struggles with his own insecurities.",
        "Movie about a male comic creator whose strong friendship with his artistic partner is tested when he develops romantic feelings for a female writer with a surprising history.",
        "What's that film where a man's perception of love and relationships is challenged by his girlfriend's past, leading to a complicated love triangle and an attempt at an unconventional solution involving his best friend?",
        "Story about two lifelong friends who create comics, one falls in love with a woman he believes is a lesbian, then finds out she isn't but has a very active sexual history that deeply bothers him and strains their friendship, culminating in a public confrontation at a sports event and a bizarre attempt to reconcile by involving his jealous friend in a threesome, ultimately leading to a breakup and a new comic based on the experience.",
        "what's that movie where a male cartoonist falls for a woman he thinks is straight, but then finds out she's a lesbian, and their eventual romantic relationship causes a rift with his business partner who harbors unspoken feelings for him, leading to a climactic attempt to resolve their issues through an unconventional sexual proposal and a later reflective comic book."
    ],
    "tt1093908": [
        "movie about a young woman who loves fashion but is drowning in credit card debt and tries to hide her shopping addiction while pursuing a career in finance journalism.",
        "film where a shopaholic writer accidentally gets a job at a financial magazine and falls for her editor, leading to humorous and awkward situations as she tries to keep her spending habits a secret from everyone, including her family and friends.",
        "romantic comedy featuring a charming but financially irresponsible woman who writes a popular advice column about managing money, despite her own struggles with debt, and eventually faces public exposure of her secret, forcing her to confront her addiction and find a path to financial recovery and true love.",
        "Story of a girl obsessed with designer clothes and accessories who constantly racks up huge credit card bills, leading to a persistent debt collector chasing her, and her attempts to get a job at a prestigious fashion magazine ultimately land her a gig at a finance publication where her unique perspective on consumerism makes her a star, but her lies about her financial situation threaten to unravel everything, culminating in a public reveal of her debts during a live television appearance.",
        "What's that movie where the main character starts off as a child dreaming of beautiful but expensive shoes and grows up to be a total shopaholic with a mountain of debt, writing a column about saving money while secretly battling her addiction, and she eventually holds an auction of all her belongings to pay off her debts, reconciling with her best friend and finding love with the guy who initially tried to help her understand the difference between cost and worth?"
    ],
    "tt1265990": [
        "College freshman moves into dorm, befriends new roommate who becomes increasingly possessive and exhibits concerning behaviors including stalking, sabotage of relationships, and violent tendencies, culminating in a dangerous confrontation.",
        "Psychological thriller about a young woman starting university who discovers her seemingly kind roommate has a dark side, leading to escalating acts of manipulation, obsession, and eventually physical harm against those close to the protagonist.",
        "Film about a college student's terrifying experience with a roommate who develops an unhealthy fixation, going to extreme lengths to isolate her from friends and family, and even harming a pet, all driven by a desperate desire for an exclusive bond.",
        "What is that movie where a new college student's roommate becomes obsessed with her, going so far as to impersonate her, injure others, and eventually attempt to kill her, all while appearing normal to outsiders?",
        "I'm looking for a movie where a fashion design student's new college roommate exhibits signs of severe mental illness, leading to creepy incidents, attacks on friends, and a final violent showdown, exploring themes of unhealthy attachment and psychological instability in a university setting."
    ],
    "tt0405422": [
        "Middle-aged man who works in electronics store and lives alone is revealed to be a virgin by his coworkers, who then try to help him lose it through various comedic and disastrous attempts.",
        "Comedy film about an awkward but sweet forty-year-old male collector of action figures and video games who finally finds love with a woman who owns an eBay store, despite his friends' well-intentioned but terrible advice about his lack of sexual experience, leading to funny situations like a painful chest waxing scene and a memorable first time on his wedding night.",
        "Story about a socially inexperienced man in his late thirties or early forties who works in retail inventory and struggles with dating, ultimately confessing a significant personal secret to the woman he is falling for, culminating in a wedding and a surprisingly short initial sexual encounter that eventually improves.",
        "What's that movie where a super organized and neat guy in his 40s who's never had sex before gets peer pressured by his friends to finally do it, and he meets a nice lady through his job but his buddies mess things up by giving him bad advice about waiting to have sex with her until after he's lost his virginity with someone else, and there's a really funny scene where he tries to put on a condom and his girlfriend's daughter walks in on them?",
        "Film plot where a meticulously clean and structured man in his forties, who is a complete virgin, has his secret exposed to his co-workers after a poker game, prompting them to undertake a series of increasingly absurd and unsuccessful schemes to help him gain sexual experience, all while he's trying to build a genuine relationship with a kind woman he meets at work, leading to a dramatic confession after a bike accident and a heartwarming conclusion on their wedding day where his long-awaited first time finally happens."
    ],
    "tt1232829": [
        "In a comedy movie, two rookie police officers who were once high school rivals are forced to go undercover as students to bust a drug ring spreading a new synthetic drug. They accidentally swap identities, leading to humorous situations where the jock becomes a nerd and the nerd becomes popular, all while trying to maintain their cover and solve the case before prom night.",
        "What's that movie where two mismatched cops, one brainy and one brawny, get sent back to high school to infiltrate a drug operation, leading to them reliving their teenage years with unexpected role reversals and hilarious consequences?",
        "Searching for a film about two clumsy but well-meaning police academy graduates who, after botching an arrest, are sent to an undercover unit specializing in youth crime, specifically infiltrating a high school to stop the distribution of a new recreational drug, resulting in them attending classes, parties, and even prom while dealing with their own unresolved high school issues?",
        "I'm looking for a movie where a jock and a nerd become police partners and are then assigned to go undercover in a high school to catch drug dealers, but they end up switching social groups and the nerd becomes popular while the jock hangs out with the nerds, leading to a lot of comedic moments and a climactic prom showdown with the drug supplier.",
        "Can you help me find a buddy cop comedy about two officers with contrasting personalities who are forced to pose as high school students to investigate a dangerous new drug, featuring scenes of them struggling to adapt to modern high school life, attending wild parties, falling for classmates, and ultimately confronting the true mastermind behind the drug trade during their senior prom, leading to a ridiculous shootout and an unexpected reveal of the real supplier?"
    ],
    "tt0758774": [
        "Movie about CIA agent tracking terrorists who use old-fashioned communication methods, featuring car chases, rocket-propelled grenades, and a strong contrast between the agent on the ground and his superior monitoring via drone, all while navigating a complex relationship with a Jordanian intelligence chief.",
        "Film about an American intelligence officer who fakes a major terrorist attack using unclaimed bodies at a Turkish air base to lure a notorious extremist leader, leading to a dangerous double-cross involving a kidnapped love interest and a dramatic rescue in Syria.",
        "Thriller exploring the ethical dilemmas of espionage, where a field agent's trust-based human intelligence clashes with his handler's Machiavellian tactics and technological surveillance, culminating in a complex plot involving framed architects, fake bombings, and shifting loyalties between intelligence agencies.",
        "What's that movie where a spy gets bitten by dogs while chasing a suspect, then concocts an elaborate scheme to create a fictional terrorist cell and stage a bombing to draw out a high-value target, only for his actions to endanger someone he cares about and reveal shocking betrayals from unexpected allies?",
        "I'm looking for a film where a CIA operative forms a fragile bond with a Jordanian intelligence head who demands absolute honesty, but their relationship is tested by rogue operations, compromised safehouses, a refusal to torture, and ultimately, a kidnapping orchestrated by one of their own to apprehend a major terrorist leader."
    ],
    "tt1071875": [
        "Movie where a stunt rider makes a deal with the devil for his father's life but becomes a demon who punishes sinners.",
        "Film about a man cursed to be a fiery demon, hiding in Eastern Europe, who eventually helps a priest protect a boy and his mother from the devil's forces, involving car chases, monastery attacks, and a battle against a resurrected henchman with darkness powers.",
        "What's that movie where a former stunt performer, now a supernatural being, gets involved with a desperate mother and her son, who is being hunted by the devil, leading to a showdown in a coliseum with an epic fight and a surprising twist involving an angel of justice?",
        "I'm looking for a movie plot where a protagonist, initially cursed, fights against the devil and his minions, encountering a morally ambiguous priest and protecting a child with a mysterious connection to the devil, culminating in a powerful redemption and transformation with holy flames.",
        "Film about a haunted individual in Eastern Europe, grappling with a demonic alter ego, who reluctantly gets drawn into a conflict between a secret order of monks and the literal devil trying to claim a special boy, featuring intense action sequences, betrayals, and the revelation of an ancient angelic entity possessing the main character, all leading to a final confrontation where the hero uses his powers for good and rescues the child from eternal damnation, ultimately embracing his new, powerful, and benevolent form."
    ],
    "tt1385826": [
        "What's that movie about a politician who meets a mysterious woman and then discovers a secret organization is trying to control his life and keep them apart?",
        "Looking for a film where a man's career in politics is intertwined with a predetermined destiny managed by shadowy figures, and he fights against it to be with the woman he loves, involving chase scenes across a city using special doors.",
        "Sci-fi romance movie plot where a powerful, unseen entity manipulates people's lives through agents in fedoras, particularly focusing on a man who is meant to become president but falls for a dancer, going against the \"plan.\"",
        "I'm trying to remember a movie about free will versus fate, where a politician keeps encountering a woman he's clearly meant to be with, but a clandestine group of men in suits intervenes, messing with their opportunities to connect and threatening dire consequences if they don't follow a preordained path, all orchestrated by a powerful, almost god-like figure.",
        "Search for a romantic thriller where a man campaigning for office keeps running into the same woman, only to find out there's a supernatural bureaucracy trying to prevent their relationship from flourishing, leading to a desperate struggle for autonomy and love against unseen forces who use ordinary objects like doors to travel instantly around New York City."
    ],
    "tt0458352": [
        "movie about a young woman who gets a demanding job as an assistant to a powerful fashion magazine editor and has to deal with her boss's unreasonable requests and the cutthroat industry while sacrificing her personal life for career advancement.",
        "storyline about a college graduate trying to make it in the high-stakes world of fashion publishing working for a terrifying female boss who dictates her every move and eventually has to choose between her integrity and success.",
        "film where an aspiring journalist struggles to fit in at a prestigious fashion magazine, deals with a very difficult female boss, learns to dress stylishly, and navigates a complicated personal life before making a big decision about her career path.",
        "what's that movie where the main character, a recent college grad, gets a seemingly dream job as an assistant to a formidable editor-in-chief at a major fashion publication, leading to a transformation in her appearance and lifestyle but also straining her relationships, culminating in her rejecting the superficial world she's entered for a more authentic life?",
        "identify movie plot: ambitious young woman endures humiliating tasks as a personal assistant to an extremely demanding female executive in the glamorous but ruthless world of high fashion, ultimately learning valuable lessons about self-worth and choosing a path true to herself over a prestigious but soul-crushing career, featuring a significant trip to Paris and a difficult decision about loyalty."
    ],
    "tt0373883": [
        "I’m looking for a scary movie from the 1970s where a masked killer escapes a mental hospital and goes back to his hometown to terrorize people on Halloween. The story focuses on a teenage girl who notices someone watching her all day, and her friends start dying in brutal ways. There’s a part where the killer strangles someone in a car and another where he pins a guy to a wall with a knife. A doctor is chasing him, trying to stop the murders, and the whole thing feels like a nightmare with this unstoppable evil. The town is small, and the houses are old. It’s got a chilling piano theme. What’s it called?",
        "Can someone help me find a horror film set in a quiet suburb where a young girl is babysitting on Halloween night and gets stalked by a masked man who killed his sister as a kid? He escapes from a sanitarium and drives back to his old house, where he starts watching this girl and her friends. The movie has a lot of tense moments, like when he hides behind bushes or stares through windows. A doctor knows he’s pure evil and tries to catch him, but the killings keep happening. It ends with a twist where the killer disappears after being shot. The vibe is super spooky and unsettling.",
        "Suspenseful story about a quiet high school girl babysitting kids while being hunted by an unstoppable evil force from her town’s past, with a chilling twist that the killer is still out there.",
        "What’s that movie where a guy in a white mask stalks a babysitter on Halloween in a small Illinois town? It starts with a kid killing his sister years ago, then he breaks out of an asylum as an adult to go back home. The plot follows this teenage girl who’s babysitting, and her friends get picked off one by one by this silent, unstoppable killer. There’s a doctor who knows how dangerous he is and tries to warn everyone, but no one listens. It’s super creepy, with scenes of the killer watching from the shadows, and it ends with him vanishing after a big showdown. The atmosphere is all about dread and suspense.",
        "Classic horror where a young girl is haunted by a mysterious figure from her town’s dark past, leading to a night of terror as she fights to survive against a relentless, evil force that escapes a mental institution."
    ],
    "tt1911644": [
        "Psychological suspense movie detailing a 911 operator's journey of redemption as she attempts to save a young girl from a kidnapper, uncovering a disturbing pattern of abductions linked to the killer's personal history and leading to a final, impactful act of vigilante justice.",
        "Story of a dedicated 911 operator who, after a traumatic past incident, finds herself embroiled in a desperate search for a teenage girl abducted from a mall, culminating in a tense showdown in a hidden cellar with a deranged killer who collects scalps.",
        "What movie involves a 911 operator who makes a fatal error with a caller, leading to a teenager's death, and then six months later gets a chance at redemption with another kidnapped girl?",
        "Search for a movie plot where a seasoned emergency operator confronts her deepest fears and a dangerous abductor, facing moral dilemmas and personal stakes as she tries to save a victim from a disturbing fate linked to a previous tragedy, leading to a climactic act of vigilante justice.",
        "I'm looking for a movie where a woman working for an emergency hotline gets a second chance to save someone after a past failure, and it turns out the villain has a bizarre fixation on blonde hair due to a personal tragedy, leading to a final confrontation in a hidden basement."
    ],
    "tt0120338": [
        "Romance on doomed ship iceberg.",
        "What's the movie about a young socialite who falls in love with a poor artist aboard an ill-fated luxury liner that sinks after hitting an iceberg?",
        "Looking for a historical romance film where a privileged young woman on a grand ocean liner in 1912 falls for a free-spirited artist, but their love story is tragically interrupted when the ship collides with an iceberg and sinks, leading to a desperate struggle for survival.",
        "Can you find a movie where a treasure hunter discovers a drawing of a woman and then an elderly survivor recounts her passionate forbidden love affair aboard a luxurious, unsinkable ship that disastrously strikes an iceberg, causing it to sink in the Atlantic Ocean, and she loses her lover but survives?",
        "Search for an epic disaster romance film that starts with a present-day deep-sea expedition to a famous shipwreck, leading to an elderly survivor recounting her dramatic tale from 1912. The story involves a wealthy young woman engaged to a cruel man who finds true love with a charming, penniless artist on the maiden voyage of a supposedly unsinkable ocean liner, and their fight for survival when the ship hits an iceberg and descends into the freezing ocean, highlighting themes of class, destiny, and enduring love."
    ],
    "tt1193138": [
        "I’m trying to find a movie about a guy who travels constantly for work, firing people across the country. He loves the airport lifestyle, lives out of a suitcase, and gives motivational talks about living without attachments. He meets a woman who’s also a frequent flyer, and they start a casual romance, but he’s forced to mentor a young coworker who wants to fire people remotely. There’s a subplot about his sister’s wedding and a cardboard cutout he has to photograph in different cities. The story has a mix of humor, sadness, and a twist about his romantic interest. It’s set during an economic downturn, and the main character struggles with his isolated life. What’s this movie called?",
        "I watched a film where the main character is a slick business traveler who fires employees for companies too cowardly to do it themselves. He’s obsessed with racking up frequent flyer miles and lives a minimalist life, avoiding relationships. He gives speeches about unloading life’s burdens, but his outlook is challenged when he trains a young, ambitious colleague who pushes for online firings. There’s a romantic subplot with a woman he meets in a hotel bar, and a family wedding that pulls him back to his roots. The movie has a bittersweet tone, with scenes in airports, hotels, and corporate offices. Can you help me identify it?",
        "Movie about a guy who flies around firing people and loves airport life, meets a woman with a similar lifestyle, but finds out she’s married when he visits her unexpectedly.",
        "Film where a frequent flyer who terminates employees for a living gives motivational speeches about living without attachments, gets involved with a businesswoman, and faces a challenge to his lifestyle from a new online firing system.",
        "Searching for a drama about a corporate downsizer who travels constantly, lives for frequent flyer miles, and has a casual romance with another traveler, but his views on relationships are tested when he’s forced to mentor a young colleague"
    ],
    "tt0119683": [
        "Movie about a man released from prison after stealing bread who is relentlessly pursued by a driven police inspector across France, becoming a mayor and then a guardian to a young girl, all while a revolution brews.",
        "What's the musical film where a former convict breaks parole, dedicates his life to good deeds, cares for an orphan, and is hounded by a persistent lawman, set against the backdrop of student uprising and unrequited love in 19th-century France?",
        "Looking for a historical drama with singing throughout, focusing on a protagonist who was a prisoner and then escapes, adopting a child whose mother was a factory worker turned prostitute, and becomes entangled in a student rebellion, ultimately leading to a confrontation with his long-time pursuer and a bittersweet ending.",
        "I'm trying to find a movie where a man is released from a long prison sentence for a petty crime, then a kind bishop changes his life, but he's still chased by a determined inspector. He becomes a respected figure, takes in an orphaned girl, and their lives intersect with a group of idealistic student revolutionaries and a conniving innkeeper family, all culminating in tragedy and redemption.",
        "Search for a sweeping historical musical where a man is hunted for decades by a police officer after breaking parole; he raises a young girl he rescued from an abusive couple, and their lives become intertwined with a student revolution in Paris, featuring iconic characters like a dying prostitute, a lovelorn student, a brave street urchin, and a tragic young woman who dies for love, with powerful themes of justice, mercy, sacrifice, and the enduring power of love and forgiveness."
    ],
    "tt1142988": [
        "Movie about a control-freak TV producer and a crass relationship expert who are forced to work together, initially clashing but eventually falling for each other.",
        "What's that romantic comedy where a morning show producer with a terrible dating life gets stuck working with a shock-jock personality who gives controversial relationship advice, and he tries to help her get another man, but they end up developing feelings for each other?",
        "Looking for a film where a highly organized female TV producer, struggling with low show ratings and an even lower success rate in dating, hires a cynical male commentator known for his blunt \"ugly truth\" about relationships, leading to a professional partnership and personal romantic development.",
        "Can you find a movie about a female television producer who is a perfectionist and has trouble finding a relationship, whose boss brings in a controversial male host with a very outspoken and crude take on dating, and despite their initial animosity, he agrees to help her land a specific guy, but through the process, they realize they are attracted to each other?",
        "I need to find the name of a romantic comedy where the plot revolves around a morning show producer desperate to boost ratings and improve her love life, who is forced to collaborate with a controversial male relationship guru. He constantly offers unsolicited and often offensive advice, yet they form an unlikely alliance as he attempts to guide her in her pursuit of another man, ultimately discovering their own undeniable chemistry and falling in love amidst the chaotic environment of live television."
    ],
    "tt0036775": [
        "Film about an insurance salesman who conspires with a woman to murder her husband for the insurance money.",
        "What's the old black and white movie where an insurance agent falls for a femme fatale and helps her kill her husband for a double indemnity payout, only to be investigated by a tenacious claims adjuster?",
        "Looking for a classic film noir where a smooth-talking insurance salesman recounts his story of being seduced by a married woman, planning a seemingly perfect murder to collect on a life insurance policy, and then facing the suspicion of his sharp colleague.",
        "Can you find a movie about a man dictating a confession after being shot, detailing how he was drawn into a murder plot by a seductive woman aiming to collect on her husband's life insurance with a double indemnity clause, and how his colleague, a claims adjuster, slowly unravels the truth, all set in a dark and cynical atmosphere?",
        "Search for a film where a seasoned insurance salesman gets entangled in a deadly scheme with a manipulative wife to murder her husband for a large insurance payout, devising a complicated plan involving a train accident. The story unfolds through the salesman's confession, revealing how their carefully constructed plot begins to unravel under the relentless investigation of his shrewd colleague, while also introducing a suspicious stepdaughter and a dramatic betrayal that leads to a violent confrontation between the two lovers."
    ],
    "tt0455538": [
        "British journalist moves to New York, struggles in upscale magazine, and falls for a colleague.",
        "What's the movie about a chaotic British journalist who gets hired by a fancy New York magazine, makes a mess of things, accidentally kills a celebrity's dog, and eventually realizes he's in love with his smart female colleague?",
        "Looking for a comedy film where a low-brow British reporter tries to make it big in the cutthroat world of celebrity journalism in New York City, constantly embarrassing himself and clashing with his editor and a cynical female co-worker, ultimately learning about genuine success and finding love.",
        "Can you find a film about an unconventional British writer who, after a wild incident involving a pig, gets a job at a prestigious magazine in NYC. He struggles to fit in with the sophisticated environment, tries to sleep with a rising starlet, creates chaos, and eventually quits to be with the woman he truly loves, a fellow journalist who's working on her own book?",
        "Search for a movie where a quirky, ambitious British journalist, known for his radical publication, gets a surprising offer to work for a high-society magazine in New York, run by an editor he once ridiculed. The plot follows his misadventures as he navigates the superficial world of celebrity, clashes with his colleagues, accidentally causes the death of a pampered dog, experiences a series of professional and personal blunders, and ultimately discovers that true happiness lies not in fame but in a genuine connection with someone who understands him."
    ],
    "tt0808510": [
        "Hockey player becomes tooth fairy.",
        "What's the movie where a cynical hockey player who crushes children's dreams is forced to become a tooth fairy for two weeks as punishment?",
        "Looking for a family comedy about a gruff athlete nicknamed \"The Tooth Fairy\" who doesn't believe in magic, but is magically conscripted into actual tooth fairy duties, flying around with wings and a wand, learning valuable life lessons about hope and belief.",
        "Can you find a movie where a jaded professional athlete, famous for his aggressive play, is sentenced by magical authorities to serve as a real tooth fairy after telling his girlfriend's daughter that fairies aren't real, leading to him growing wings, shrinking, and performing actual tooth fairy duties?",
        "Search for a heartwarming fantasy comedy film about a aging ice hockey player who, after shattering a young girl's belief in the tooth fairy, is magically summoned to a secret realm and forced to temporarily become a tooth fairy himself as a form of punishment, gaining magical abilities, encountering other mythical creatures, and ultimately transforming into a more optimistic and loving person who proposes to his girlfriend."
    ],
    "tt1428538": [
        "Hansel and Gretel grown up witch hunters.",
        "What's the movie about adult Hansel and Gretel, who survived the gingerbread house witch, now bounty hunters specifically tracking down and killing witches, where Hansel is diabetic?",
        "Looking for a dark fantasy action movie where the famous fairy tale siblings are now immune to witch spells and actively exterminate witches, trying to stop a powerful grand witch from sacrificing children during a Blood Moon ritual, and they uncover secrets about their own past.",
        "Can you find a film about Hansel and Gretel as adults who become professional witch hunters after their childhood trauma, battling a powerful grand witch, discovering their mother was a white witch, and teaming up with a troll and a local boy to stop a dark ritual?",
        "Search for an action-horror film adaptation of a classic fairy tale where Hansel and Gretel, now highly skilled and resilient adults, are a formidable duo dedicated to eradicating witches after their traumatic childhood experience in a gingerbread house. The plot involves them being hired to rescue abducted children from a powerful Grand Witch who needs them for a dark ritual during a Blood Moon, revealing secrets about their own lineage as their mother was a white witch, leading to an intense confrontation and a shocking twist about their past."
    ],
    "tt0989757": [
        "Soldier falls in love on leave.",
        "What's the romance movie about a Special Forces sergeant who meets a college student on spring break, they fall in love, and their relationship is tested when he re-enlists after 9/11?",
        "Looking for a film about a military man and a kind-hearted woman who meet while he's on leave, share a passionate romance, and try to maintain their relationship through letters as his service extends due to a national crisis, ultimately facing heartbreak and sacrifice.",
        "Can you find a movie where a soldier on leave falls in love with a college student helping Habitat for Humanity, and their epistolary relationship is severely strained by his decision to re-enlist after a major national tragedy, leading to a \"Dear John\" letter and later a surprising act of selfless generosity involving his father's coin collection?",
        "Search for a poignant romantic drama that begins with a soldier on leave in Wilmington, North Carolina, falling deeply in love with a benevolent college student during her spring break. Their relationship, initially blossoming through shared time and letters, is challenged by the soldier's extended deployment post-9/11, leading to a heartbreaking separation and a later revelation involving the woman's marriage to another man who is ill, ultimately culminating in a significant act of self-sacrifice by the soldier and a hopeful, enduring connection under a full moon."
    ],
    "tt1136608": [
        "Alien refugee camp Johannesburg mutating human.",
        "What's the sci-fi movie about an alien ship over Johannesburg, a human turning into an alien, and a government company exploiting the extraterrestrial refugees for their advanced weapons?",
        "Looking for a gritty sci-fi film where aliens are quarantined in a slum called District 9 in South Africa, and a human operative tasked with relocating them accidentally gets infected and starts transforming into one of the \"prawns,\" becoming a fugitive and the key to the aliens' escape.",
        "Can you find a movie where a bureaucrat from a private military corporation overseeing an alien slum in Johannesburg is accidentally contaminated by an alien fluid, causing him to slowly mutate into one of the \"prawns,\" leading him to seek refuge among the aliens he once oppressed and uncover the company's sinister experiments with alien bioweapons?",
        "Search for a unique science fiction film set in South Africa where an alien spaceship has been hovering over Johannesburg for twenty years, leading to the impoverished \"prawn\" aliens being confined to a ghetto. The plot follows an MNU agent who is exposed to an alien substance and begins a painful transformation into an alien himself, forcing him to ally with an intelligent alien to escape the corporation trying to vivisect him and expose their unethical experimentation on the alien population."
    ],
    "tt0889583": [
        "Gay Austrian fashion reporter tries to become superstar.",
        "What's the movie about a flamboyant European TV personality who comes to America to gain fame, creating outrageous celebrity interviews, attempting to solve world peace, and trying to adopt a child?",
        "Looking for a mockumentary film about a highly eccentric and controversial fashion reporter who, after being fired, attempts to achieve global stardom through increasingly bizarre and often offensive stunts, including adopting a baby from Africa and trying to \"go straight.\"",
        "Can you find a comedy film where a over-the-top Austrian journalist, accompanied by his assistant, travels to the United States aiming for celebrity status, gets into bizarre situations involving politicians, terrorist leaders, and child models, and eventually tries gay conversion therapy before finding love and recording a charity song?",
        "Search for a satirical movie centered on a flamboyant, high-fashion Austrian journalist who, after a career setback, embarks on a quest for fame in America, engaging in shocking and inappropriate behavior such as interviewing a politician he mistakes for a drag queen, trying to broker peace in the Middle East, acquiring a baby in Africa for publicity, and even undergoing a bizarre attempt to become heterosexual, all culminating in a public reunion with his former assistant and a celebrity-studded charity single."
    ],
    "tt1375670": [
        "Childhood friends reunite for coach's funeral.",
        "What's the comedy movie about five former junior high basketball champions who reunite 30 years later for their coach's funeral and spend a Fourth of July weekend at a lake house?",
        "Looking for a film where a group of middle-aged men, former basketball teammates, gather with their families at a lake house after their coach dies, dealing with their personal lives, family issues, and rekindling old rivalries, culminating in a basketball rematch.",
        "Can you find a movie about a Hollywood agent, a stay-at-home dad, a man who lost his job, a single womanizer, and a vegan married to an older woman, all former basketball friends, who spend a chaotic holiday weekend together after their coach's funeral, tackling spoiled kids and marital issues?",
        "Search for a comedy movie centered on a group of five childhood friends who won a junior high basketball championship and reconnect three decades later for their beloved coach's funeral. The story then follows their families as they spend a Fourth of July weekend at a lake house, revealing their varied adult lives, their struggles with spoiled children, financial secrets, and marital problems, all while reliving their past and facing a surprising basketball rematch against old rivals."
    ],
    "tt1596346": [
        "Teen surfer loses arm to shark.",
        "What's the true story movie about a young female surfer in Hawaii who loses her arm in a shark attack but eventually returns to professional surfing?",
        "Looking for a biographical drama about a teenage surfer whose life is dramatically altered when she is attacked by a shark, resulting in the loss of her arm, and her journey to overcome this challenge and continue her passion for surfing, finding inspiration along the way.",
        "Can you find a film about a dedicated teenage surfer from Hawaii who, after a devastating shark attack severs her arm, bravely fights to recover and adapt to surfing with one arm, eventually re-entering competitions and even helping tsunami victims in Thailand, discovering a deeper purpose in her life?",
        "Search for an inspiring movie based on a true story, set in Kauai, Hawaii, focusing on a passionate teenage surfer who experiences a traumatic shark attack, resulting in the loss of her left arm. The plot follows her arduous physical and emotional recovery, her determination to get back on her surfboard, and her journey to rediscover her competitive spirit and use her experience to inspire others, including a pivotal mission trip to tsunami-devastated Thailand, culminating in her triumphant return to the sport."
    ],
    "tt0814314": [
        "Man donates organs to seven people.",
        "What's the movie about a man who causes a fatal car accident and then seeks redemption by anonymously donating his organs to seven strangers before committing suicide?",
        "Looking for a drama film where a guilt-ridden former aeronautical engineer, responsible for a multi-car pile-up that killed his fiancée and six others, meticulously plans his own death to save seven \"good\" strangers through organ donation, falling in love with one of his recipients in the process.",
        "Can you find a movie about a man who uses his brother's IRS credentials to investigate deserving individuals, secretly donating his organs to them one by one as a form of atonement for a tragic accident, all while battling his growing feelings for a woman on his recipient list who has a rare heart condition?",
        "Search for an emotional film about a man haunted by a car crash that killed seven people, including his fiancée. He meticulously orchestrates a plan to donate his vital organs to seven deserving strangers, interviewing each one under false pretenses. The plot involves him giving a lung, part of his liver, a kidney, and bone marrow, and moving a family out of an abusive home, but his final act of self-sacrifice becomes complicated when he falls deeply in love with a woman on his list who needs a heart transplant, leading to a poignant and tragic climax involving a jellyfish."
    ],
    "tt0800369": [
        "Norse god banished to Earth.",
        "What's the superhero movie about a powerful but arrogant warrior from another realm who is stripped of his powers and exiled to Earth, where he learns humility and fights against his adoptive brother's schemes?",
        "Looking for a fantasy action film where a prince from a mythical realm, after provoking a war with frost giants, is cast out by his father onto Earth without his mighty hammer, and must prove himself worthy to regain his powers and prevent his jealous brother from seizing the throne and destroying a world.",
        "Can you find a movie about an exiled celestial prince who lands in the New Mexico desert, is discovered by a brilliant astrophysicist, and has to contend with a secret government agency while his deceptive brother plots to conquer their home world by letting frost giants in to kill their sleeping father?",
        "Search for a superhero origin story where an arrogant warrior prince from Asgard is banished to Earth after defying his father and reigniting an ancient war. He falls in love with a human scientist while trying to retrieve his powerful hammer, which only responds to those who are worthy. Meanwhile, his manipulative adopted brother plots to usurp the throne and destroy a rival realm, leading to a climactic battle on the Bifrost Bridge and a significant post-credits scene involving a director and a powerful artifact."
    ],
    "tt1282140": [
        "High school girl fake sex rumors.",
        "What's the comedy movie about a high school student whose lie about losing her virginity spirals out of control, leading her to embrace a \"bad girl\" reputation with a red \"A\" on her clothes?",
        "Looking for a teen movie where a lie about sexual activity spreads through a high school, causing the protagonist to become an outcast who then ironically profits by faking encounters for other students to boost their popularity, all while a religious clique tries to ostracize her.",
        "Can you find a film about a high school girl who, to avoid a camping trip, invents a story about a date that escalates into a false rumor about losing her virginity. She then strategically uses this reputation to help bullied students and her own finances, eventually revealing the truth in a public webcam broadcast after facing accusations and a scandal involving a teacher.",
        "Search for a satirical high school comedy centered on a witty and initially unassuming teenage girl who tells a white lie about her weekend, which is overheard by a religious classmate and quickly transforms into a widespread rumor about her promiscuity. Instead of fighting it, she leans into the scandalous image, even sewing a red letter \"A\" onto her clothes, becoming a paid \"fixer\" for unpopular boys seeking social status, all while navigating a judgmental school environment, a secret affair involving a teacher, and ultimately finding a clever way to clear her name and expose the hypocrisy around her."
    ],
    "tt1564367": [
        "Plastic surgeon fakes marriage.",
        "What's the romantic comedy where a plastic surgeon pretends to be married to get women, but then needs his assistant to pose as his soon-to-be ex-wife, leading to a trip to Hawaii and unexpected romance?",
        "Looking for a movie about a man who uses a fake wedding ring to avoid commitment, but when he meets someone he likes, he enlists his loyal office manager and her kids to maintain the charade, leading to a complicated vacation and genuine feelings developing between him and his assistant.",
        "Can you find a film about a commitment-phobic plastic surgeon who, after being caught with his wedding ring, convinces his office manager to pretend to be his divorcing wife, a lie that escalates to include her children and a trip to Hawaii where they encounter his assistant's rival from college and he realizes his true feelings for his long-time employee?",
        "Search for a romantic comedy set in Los Angeles and Hawaii, involving a successful plastic surgeon who habitually lies about being unhappily married to attract women. His elaborate deception forces his sensible, divorced office manager to pose as his estranged wife, and her children inadvertently become part of the charade. The plot features a family vacation to Hawaii, an encounter with a long-standing rival, and a series of comical misunderstandings that ultimately lead the surgeon to realize he's in love with his assistant."
    ],
    "tt1298649": [
        "Neighborhood watch fights aliens.",
        "What's the comedy movie about a suburban man who forms a neighborhood watch after a murder, only to discover that aliens are secretly infiltrating their town and planning an invasion?",
        "Looking for a funny film where a group of misfit men in a quiet Ohio town create a neighborhood watch that accidentally uncovers a vast alien conspiracy involving disguised extraterrestrials stealing human skin and building a device to summon their armada, leading to a ridiculous battle at a Costco.",
        "Can you find a movie about an overzealous community leader who, after a murder at his Costco, gathers an unlikely trio for a neighborhood watch, only to stumble upon an alien plot to destroy Earth. The plot involves discovering alien brains are in their crotch and fighting disguised extraterrestrials, while also dealing with personal issues like infertility and a daughter's problematic boyfriend.",
        "Search for a comedic sci-fi action film where an ordinary suburban man in Ohio forms a quirky neighborhood watch after a local murder, consisting of a construction worker, a high school dropout, and a recent divorcee. They soon realize the crime is part of a larger alien invasion plot, with the extraterrestrials disguising themselves as humans and building a destructive transmitter under a Costco, leading to a chaotic showdown where they discover the aliens' unique weakness and save the world."
    ],
    "tt0970866": [
        "Son-in-law tries to impress father-in-law.",
        "What's the comedy movie where a man nicknamed \"Godfocker\" tries to prove himself worthy to his intensely suspicious ex-CIA father-in-law, leading to misunderstandings about a male enhancement drug and an affair?",
        "Looking for a film about a male nurse who, after his father-in-law suffers a heart attack, is named the \"Godfocker\" of the family, but then his attempts to secure his kids into a private school and become a spokesperson for a male enhancement drug are constantly misinterpreted by his paranoid father-in-law, leading to hilarious confrontations.",
        "Can you find a movie about a man whose already strained relationship with his intimidating ex-CIA father-in-law becomes even more chaotic when the father-in-law has a heart attack and appoints him the new family patriarch. The plot involves misunderstandings about a pharmaceutical saleswoman, a prolonged erection, a family fight at a child's birthday party, and the constant surveillance by the suspicious father-in-law.",
        "Search for a comedy film that continues the saga of a son-in-law constantly trying to earn the approval of his distrustful, former CIA father-in-law. After the father-in-law suffers a heart attack and bestows a new \"Godfocker\" title, the son-in-law's efforts to provide for his family and explore new career opportunities are repeatedly misconstrued as infidelity or incompetence, leading to escalating absurdity involving a male enhancement drug, a highly suspicious cat, and a climactic birthday party brawl, all while the two families try to navigate their dysfunctional dynamic."
    ],
    "tt0119654": [
        "Secret agents manage aliens.",
        "What's the sci-fi comedy about a secret government agency that monitors and polices extraterrestrial lifeforms living disguised on Earth, and a veteran agent takes on a new, street-smart partner?",
        "Looking for a film where a shadowy organization uses memory-wiping devices to keep alien presence on Earth a secret, and two agents, one seasoned and one rookie, must stop a giant cockroach-like alien from obtaining a powerful object called \"The Galaxy\" to win an interstellar war.",
        "Can you find a movie about an elite, un-governmental agency operating out of a New York City ventilation station, whose agents wear black suits and use memory erasers. A cynical veteran recruits a quick-thinking police detective, and they must race against time to stop a monstrous \"Bug\" alien from acquiring a universe-containing artifact to turn the tide in an intergalactic conflict, ultimately leading to the veteran agent's retirement.",
        "Search for a comedic science fiction action movie set primarily in New York City, where a clandestine organization known for disguising aliens as humans and wiping human memories, takes on a new recruit. The plot involves the new agent learning the ropes from his experienced, stoic partner as they track a monstrous, cockroach-like alien that has come to Earth to retrieve a miniature galaxy, which is crucial for an interspecies war, leading to a desperate race against time to save Earth from destruction and a surprising partner replacement."
    ],
    "tt0316655": [
        "High school nerd gains spider powers.",
        "What's the superhero origin movie about a shy high school student in New York who gets bitten by a genetically altered spider, develops superpowers, and becomes a masked crime fighter while battling a green-armored villain who is his best friend's father?",
        "Looking for a film where a bullied teenager living with his aunt and uncle gains superhuman abilities after a spider bite, struggles with the responsibility that comes with his new powers after a personal tragedy, and then becomes a web-slinging hero fighting against a deranged industrialist who uses a high-tech suit and glider.",
        "Can you find a movie where a nerdy high school student secretly develops spider-like abilities after a field trip to a genetics lab, leading him to a career in wrestling and then as a masked vigilante in New York City after his uncle's death. He also navigates a complicated crush on his neighbor and fights against a villain who is also the father of his best friend.",
        "Search for a superhero film set in New York City, chronicling the origin story of a shy, intelligent high school senior who, after being bitten by a genetically engineered spider, develops incredible agility, strength, and the ability to shoot webs. This transformation comes with a heavy personal cost after his beloved uncle's death, prompting him to embrace his powers for good. He faces off against a deranged villain who is also the wealthy, influential father of his best friend, leading to dramatic confrontations and a tragic reveal, all while trying to balance his secret identity with his burgeoning feelings for his neighbor."
    ]
}